[
  {
    "title": "TLT Leads With $802.5M for Treasury Bond ETF",
    "link": "http://www.etf.com/sections/daily-etf-flows/tlt-leads-8025m-treasury-bond-etf?utm_source=yahoo-finance&utm_medium=rss&utm_campaign=yahoo-finance-rss&.tsrc=rss",
    "content": "The ARK 21Shares Bitcoin ETF (ARKB) has $97 million in outflows: Here are the daily ETF fund flows for Feb. 14, 2025.",
    "pubDate": "Fri, 14 Feb 2025 23:00:31 +0000"
  },
  {
    "title": "Will This Week's Inflation, GDP Data Move Markets?",
    "link": "http://www.etf.com/sections/news/will-weeks-inflation-gdp-data-move-markets?utm_source=yahoo-finance&utm_medium=rss&utm_campaign=yahoo-finance-rss&.tsrc=rss",
    "content": "The economic week will be eventful also with the release of a key housing indicator.",
    "pubDate": "Mon, 22 Jul 2024 12:00:00 +0000"
  },
  {
    "title": "YieldMax™ Launches Short NVDA Option Income Strategy ETF (DIPS)",
    "link": "https://finance.yahoo.com/news/yieldmax-launches-short-nvda-option-105500822.html?.tsrc=rss",
    "content": "CHICAGO and MILWAUKEE and NEW YORK, July 24, 2024 (GLOBE NEWSWIRE) -- YieldMax™ announced the launch today of the following ETF: YieldMax™ Short NVDA Option Income Strategy ETF (NYSE Arca: DIPS) DIPS Overview DIPS is an actively managed ETF that seeks to generate current income from a synthetic covered put strategy on NVIDIA Corporation (“NVDA”), while providing indirect short (inverse) exposure to the share price of NVDA. DIPS’s potential for gains from decreases in the share price of NVDA is l",
    "pubDate": "Wed, 24 Jul 2024 10:55:00 +0000"
  },
  {
    "title": "YieldMax™ ETFs Announces Monthly Distributions on Fund of Funds and Ultra ETFs",
    "link": "https://finance.yahoo.com/news/yieldmax-etfs-announces-monthly-distributions-120100589.html?.tsrc=rss",
    "content": "YMAX (38.78%) YMAG (35.78%) ULTY (83.72%)CHICAGO, MILWAUKEE and NEW YORK, July 16, 2024 (GLOBE NEWSWIRE) -- YieldMax™ today announced monthly distributions on the following YieldMax™ ETFs: ETF Ticker1ETF NameDistribution per ShareDistribution Rate230-Day SEC Yield3Ex-Date & Record DatePayment DateYMAXYieldMax™ Universe Fund of Option Income ETFs$0.651638.78%62.89%7/17/20247/18/2024YMAGYieldMax™ Magnificent 7 Fund of Option Income ETFs$0.636535.78%46.89%7/17/20247/18/2024ULTYYieldMax™ Ultra Optio",
    "pubDate": "Tue, 16 Jul 2024 12:01:00 +0000"
  },
  {
    "title": "YieldMax™ Launches Short COIN Option Income Strategy ETF (FIAT)",
    "link": "https://finance.yahoo.com/news/yieldmax-launches-short-coin-option-105500125.html?.tsrc=rss",
    "content": "CHICAGO, MILWAUKEE and NEW YORK, July 10, 2024 (GLOBE NEWSWIRE) -- YieldMax™ announced the launch today of the following ETF: YieldMax™ Short COIN Option Income Strategy ETF (NYSE Arca: FIAT) FIAT Overview FIAT is an actively managed ETF that seeks to generate current income from a synthetic covered put strategy on Coinbase Global, Inc. (“COIN”), while providing indirect short (inverse) exposure to the share price of COIN. FIAT’s potential for gains from decreases in the share price of COIN is l",
    "pubDate": "Wed, 10 Jul 2024 10:55:00 +0000"
  },
  {
    "title": "YieldMax™ Launches Option Income Strategy ETF on Airbnb (ABNB)",
    "link": "https://finance.yahoo.com/news/yieldmax-launches-option-income-strategy-112400136.html?.tsrc=rss",
    "content": "CHICAGO and MILWAUKEE and NEW YORK, June 25, 2024 (GLOBE NEWSWIRE) -- YieldMax™ announced the launch today of the following ETF: YieldMax™ ABNB Option Income Strategy ETF (NYSE Arca: ABNY) ABNY seeks to generate current income via a synthetic covered call strategy on Airbnb, Inc. (ABNB). ABNY is actively managed by ZEGA Financial. ABNY does not invest directly in ABNB. ABNY is the newest member of the growing YieldMax™ ETF family and, like all YieldMax™ ETFs, aims to deliver current income to in",
    "pubDate": "Tue, 25 Jun 2024 11:24:00 +0000"
  },
  {
    "title": "Is the Stock Market Open Today? Here Are the Trading Hours for Juneteenth.",
    "link": "https://finance.yahoo.com/m/50e37736-e32f-36e5-9add-6e6b83c0c350/is-the-stock-market-open.html?.tsrc=rss",
    "content": "Juneteenth—a portmanteau of “June nineteenth”—is here, a day characterized by parades and festivities across the U.S. But what does it mean for the market?  The Census Bureau released retail sales data on Tuesday, which came in weaker than expected.  On Wednesday, Federal Reserve officials opted to hold interest rates steady and forecast two rate cuts by the end of 2025.",
    "pubDate": "Thu, 19 Jun 2025 10:00:00 +0000"
  },
  {
    "title": "Nasdaq Announces Results from 2025 Annual Meeting of Shareholders",
    "link": "https://finance.yahoo.com/news/nasdaq-announces-results-2025-annual-203000779.html?.tsrc=rss",
    "content": "All 12 Nominated Directors Elected Nasdaq Board Re-elects Adena T. Friedman as Chair of the Board NEW YORK, June 16, 2025 (GLOBE NEWSWIRE) -- Nasdaq, Inc. (Nasdaq: NDAQ) shareholders elected all nominated directors at the company’s Annual Meeting of Shareholders on Wednesday, June 11, 2025. All directors will serve one-year terms. The elected board members are: Melissa M. Arnoldi, EVP and General Manager for Business Solutions, AT&T Inc.Charlene T. Begley, Retired SVP and CIO, General Electric C",
    "pubDate": "Mon, 16 Jun 2025 20:30:00 +0000"
  },
  {
    "title": "Delisting of Securities of Blue Star Foods Corp.; Altamira Therapeutics Ltd.; Evergreen Corporation; Fresh2 Group Limited; Coliseum Acquisition Corp.; The Real Good Food Company, Inc.; Mynaric AG; byNordic Acquisition Corporation; Avinger Inc.; MultiMetaVerse Holdings Limited; Nature's Miracle Holding Inc.; and SPI Energy Co., Ltd. from the Nasdaq Stock Market",
    "link": "https://finance.yahoo.com/news/delisting-securities-blue-star-foods-200500921.html?.tsrc=rss",
    "content": "NEW YORK, June 11, 2025 (GLOBE NEWSWIRE) -- The Nasdaq Stock Market announced today that it will delist the common stock of Blue Star Foods Corp. Blue Star Foods Corp.’s stock was suspended on December 20, 2024 and has not traded on Nasdaq since that time. Nasdaq also announced today that it will delist the common shares of Altamira Therapeutics Ltd. Altamira Therapeutics Ltd.’s stock was suspended on December 20, 2024 and has not traded on Nasdaq since that time. Nasdaq also announced today tha",
    "pubDate": "Wed, 11 Jun 2025 20:05:00 +0000"
  },
  {
    "title": "Nasdaq Announces End-of-Month Open Short Interest Positions in Nasdaq Stocks as of Settlement Date May 30, 2025",
    "link": "https://finance.yahoo.com/news/nasdaq-announces-end-month-open-200500276.html?.tsrc=rss",
    "content": "NEW YORK, June 10, 2025 (GLOBE NEWSWIRE) -- At the end of the settlement date of May 30, 2025, short interest in 3,184 Nasdaq Global MarketSM securities totaled 13,504,275,894 shares compared with 13,735,568,588 shares in 3,168 Global Market issues reported for the prior settlement date of May 15, 2025. The mid-May short interest represents 2.19 days compared with 2.41 days for the prior reporting period. Short interest in 1,632 securities on The Nasdaq Capital MarketSM totaled 2,610,068,615 sha",
    "pubDate": "Tue, 10 Jun 2025 20:05:00 +0000"
  },
  {
    "title": "Be Sure To Check Out Nasdaq, Inc. (NASDAQ:NDAQ) Before It Goes Ex-Dividend",
    "link": "https://finance.yahoo.com/news/sure-check-nasdaq-inc-nasdaq-193338411.html?.tsrc=rss",
    "content": "Readers hoping to buy Nasdaq, Inc. ( NASDAQ:NDAQ ) for its dividend will need to make their move shortly, as the stock...",
    "pubDate": "Tue, 10 Jun 2025 19:33:38 +0000"
  },
  {
    "title": "NDAQ Hits 52-Week High, Trades at a Discount: How to Play the Stock",
    "link": "https://finance.yahoo.com/news/ndaq-hits-52-week-high-132900988.html?.tsrc=rss",
    "content": "Nasdaq is set to grow on its increasing on-trading revenue base, impressive organic growth and investments in proprietary data, supported by a solid capital position.",
    "pubDate": "Mon, 09 Jun 2025 13:29:00 +0000"
  },
  {
    "title": "Nasdaq Launches Exclusive Access to Nasdaq Private Market’s Tape D® API to Deliver Advanced Visibility into Private Markets",
    "link": "https://finance.yahoo.com/news/nasdaq-launches-exclusive-access-nasdaq-143500506.html?.tsrc=rss",
    "content": "Real-Time Private Company Dataset Offers Critical Pricing and Valuation Insights for Private Companies, Investors, and AdvisorsNEW YORK, June 04, 2025 (GLOBE NEWSWIRE) -- Nasdaq® (Nasdaq: NDAQ) announced today that the company has partnered with Nasdaq Private Market (NPM), a leading provider of secondary liquidity solutions to private companies, employees, and investors, to provide greater price transparency and valuation visibility into private, pre-IPO companies, including unicorns and other",
    "pubDate": "Wed, 04 Jun 2025 14:35:00 +0000"
  },
  {
    "title": "Nasdaq Reports May 2025 Volumes",
    "link": "https://finance.yahoo.com/news/nasdaq-reports-may-2025-volumes-200500634.html?.tsrc=rss",
    "content": "NEW YORK, June 03, 2025 (GLOBE NEWSWIRE) -- Nasdaq (Nasdaq: NDAQ) today reported monthly volumes for May 2025 on its Investor Relations website. A data sheet showing this information can be found at: http://ir.nasdaq.com/financials/volume-statistics. About Nasdaq Nasdaq (Nasdaq: NDAQ) is a leading global technology company serving corporate clients, investment managers, banks, brokers, and exchange operators as they navigate and interact with the global capital markets and the broader financial",
    "pubDate": "Tue, 03 Jun 2025 20:05:00 +0000"
  },
  {
    "title": "Nasdaq's (NASDAQ:NDAQ) Shareholders Will Receive A Bigger Dividend Than Last Year",
    "link": "https://finance.yahoo.com/news/nasdaqs-nasdaq-ndaq-shareholders-receive-124944939.html?.tsrc=rss",
    "content": "Nasdaq, Inc. ( NASDAQ:NDAQ ) will increase its dividend from last year's comparable payment on the 27th of June to...",
    "pubDate": "Fri, 30 May 2025 12:49:44 +0000"
  },
  {
    "title": "Nasdaq Executives to Present at Upcoming Investor Conferences",
    "link": "https://finance.yahoo.com/news/nasdaq-executives-present-upcoming-investor-200500263.html?.tsrc=rss",
    "content": "NEW YORK, May 28, 2025 (GLOBE NEWSWIRE) -- Nasdaq (Nasdaq: NDAQ) will be presenting at the following conferences in June with webcasts available at Nasdaq’s Investor Relations website: ir.nasdaq.com/events.cfm. Who:Adena Friedman, Chair and CEO, NasdaqWhat:Piper Sandler Global Exchange & Trading ConferenceWhen:Thursday, June 5, 20252:30 PM ET Who:Tal Cohen, President, NasdaqWhat:Morgan Stanley US Financials ConferenceWhen:Tuesday, June 10, 20259:45 AM ET About Nasdaq Nasdaq (Nasdaq: NDAQ) is a g",
    "pubDate": "Wed, 28 May 2025 20:05:00 +0000"
  },
  {
    "title": "Nasdaq Announces Mid-Month Open Short Interest Positions in Nasdaq Stocks as of Settlement Date May 15, 2025",
    "link": "https://finance.yahoo.com/news/nasdaq-announces-mid-month-open-200500945.html?.tsrc=rss",
    "content": "NEW YORK, May 27, 2025 (GLOBE NEWSWIRE) -- At the end of the settlement date of May 15, 2025, short interest in 3,168 Nasdaq Global MarketSM securities totaled 13,735,568,588 shares compared with 13,300,707,903 shares in 3,156 Global Market issues reported for the prior settlement date of April 30, 2025. The mid-May short interest represents 2.41 days compared with 2.40 days for the prior reporting period. Short interest in 1,639 securities on The Nasdaq Capital MarketSM totaled 2,731,907,808 sh",
    "pubDate": "Tue, 27 May 2025 20:05:00 +0000"
  },
  {
    "title": "Delisting of Securities from The Nasdaq Stock Market",
    "link": "https://finance.yahoo.com/news/delisting-securities-nasdaq-stock-market-200500434.html?.tsrc=rss",
    "content": "Delisting of Securities of Bruush Oral Care Inc., IX Acquisition Corp., BAIYU Holdings, Inc., DUET Acquisition Corp., ENGlobal Corporation, Perception Capital Corp. III, Biora Therapeutics, Inc., Akoustis Technologies, Inc., iLearningEngines, Inc., Welsbach Technology Metals Acquisition Corp., Cartica Acquisition Corp, CSLM Acquisition Corp., Broad Capital Acquisition Corp, Technology & Telecommunication Acquisition Corporation, Western Acquisition Ventures Corp., Papaya Growth Opportunity Corp.",
    "pubDate": "Fri, 23 May 2025 20:05:00 +0000"
  },
  {
    "title": "Nasdaq (NasdaqGS:NDAQ) Enhances Philippine Infrastructure with New Eqlipse Trading Platform",
    "link": "https://finance.yahoo.com/news/nasdaq-nasdaqgs-ndaq-enhances-philippine-173848398.html?.tsrc=rss",
    "content": "Nasdaq (NasdaqGS:NDAQ) recently expanded its technology partnership with The Philippine Stock Exchange, enhancing its trading infrastructure with the advanced Nasdaq Eqlipse Trading platform. This move adds to the solid performance Nasdaq has showcased, reflected in a nearly 11% rise in its share price over the last month. The surge can be attributed to robust Q1 earnings, increased dividends, and strategic collaborations in Asia. These developments occur amidst a tech sector rally and...",
    "pubDate": "Thu, 22 May 2025 17:38:48 +0000"
  },
  {
    "title": "Philippine Stock Exchange Adopts Nasdaq Eqlipse Trading to Enhance Market Infrastructure",
    "link": "https://finance.yahoo.com/news/philippine-stock-exchange-adopts-nasdaq-090100075.html?.tsrc=rss",
    "content": "Nasdaq and The Philippine Stock Exchange Signing Ceremony Nasdaq President Tal Cohen and PSE President and CEO Ramon S. Monzon Upgrade to Nasdaq Eqlipse Trading will enhance liquidity and resilience of Philippine marketplace Expands Nasdaq’s deep technology footprint across the country’s financial services industry MANILA and NEW YORK, May 22, 2025 (GLOBE NEWSWIRE) -- Nasdaq (Nasdaq: NDAQ) and The Philippine Stock Exchange, Inc. (PSE) today announced a significant expansion of their technology p",
    "pubDate": "Thu, 22 May 2025 09:01:00 +0000"
  },
  {
    "title": "Thoma Bravo sold out of remaining 7% stake in Nasdaq, Bloomberg reports",
    "link": "https://finance.yahoo.com/news/thoma-bravo-sold-remaining-7-154548051.html?.tsrc=rss",
    "content": "Private equity firm Thoma Bravo divested around 43M shares, or about 7.4%, of Nasdaq (NDAQ) in unregistered block trades on May 7 and May 13, selling its remaining stake for proceeds of about $3.4B, people familiar with the matter told Bloomberg’s Ryan Gould and Anthony Hughes. The private equity firm worked with JPMorgan Chase (JPM) on the sale, according to the sources. Published first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>> See the top s",
    "pubDate": "Fri, 16 May 2025 15:45:48 +0000"
  },
  {
    "title": "Thoma Bravo Exits Nasdaq with $3.4B Finale -- And a Fat Paycheck",
    "link": "https://finance.yahoo.com/news/thoma-bravo-exits-nasdaq-3-184018072.html?.tsrc=rss",
    "content": "Private equity firm unloads final stake in Nasdaq after cashing in big on Adenza deal",
    "pubDate": "Thu, 15 May 2025 18:40:18 +0000"
  },
  {
    "title": "Africa Oil to Change Name to Meren Energy",
    "link": "https://finance.yahoo.com/news/africa-oil-change-name-meren-113201383.html?.tsrc=rss",
    "content": "Africa Oil (AOI.TO) on Thursday said it is changing its name to Meren Energy. The upstream oil an",
    "pubDate": "Thu, 15 May 2025 11:32:01 +0000"
  },
  {
    "title": "Nasdaq Announces 2025 Annual Meeting of Shareholders",
    "link": "https://finance.yahoo.com/news/nasdaq-announces-2025-annual-meeting-200500299.html?.tsrc=rss",
    "content": "NEW YORK, May 14, 2025 (GLOBE NEWSWIRE) -- Nasdaq, Inc. (Nasdaq: NDAQ) has scheduled its 2025 Annual Meeting of Shareholders for June 11, 2025, at 8:00 AM ET. The virtual meeting website can be accessed 15 minutes prior to the meeting start by visiting: www.virtualshareholdermeeting.com/NDAQ2025. Shareholders of record as of April 14, 2025 will be eligible to vote and participate in the Annual Meeting. Nasdaq’s 2025 Proxy Statement and 2024 Annual Report on Form 10-K are available at ir.nasdaq.c",
    "pubDate": "Wed, 14 May 2025 20:05:00 +0000"
  },
  {
    "title": "Nasdaq Applauds Signing of Senate Bill 29, Strengthening Texas’ Standing as a National Leader in Corporate Governance and Innovation",
    "link": "https://finance.yahoo.com/news/nasdaq-applauds-signing-senate-bill-191200202.html?.tsrc=rss",
    "content": "AUSTIN, Texas, May 14, 2025 (GLOBE NEWSWIRE) -- Today, Nasdaq issued a statement in support of Texas Senate Bill 29 after Governor Abbott signed the bill into law. This legislation, which codifies the Business Judgment Rule and promotes predictability in corporate governance litigation, enhances Texas’ competitiveness as a jurisdiction for incorporation and business growth. Nasdaq's Executive Vice Chairman Ed Knight joined Governor Abbott, leadership from the Texas legislature, and other Texas b",
    "pubDate": "Wed, 14 May 2025 19:12:00 +0000"
  },
  {
    "title": "Fincom Announces Series B Financing Led by Nasdaq Ventures with Participation from Macquarie Group and G1 Ventures",
    "link": "https://finance.yahoo.com/news/fincom-announces-series-b-financing-130000087.html?.tsrc=rss",
    "content": "Fincom, a leader in anti-money laundering (AML) Sanction Screening and Entity Resolution technology, today announced the successful completion of its Series B funding round, securing a strategic investment led by Nasdaq Ventures, with participation from Macquarie Group, G1 Ventures, and existing investors including AnD Ventures and ff Venture Capital. This investment marks a significant milestone in Fincom's growth journey and underscores confidence in its vision and market potential.",
    "pubDate": "Tue, 13 May 2025 13:00:00 +0000"
  },
  {
    "title": "Is the Stock Market Open Today? Here Are the Trading Hours for Juneteenth.",
    "link": "https://finance.yahoo.com/m/50e37736-e32f-36e5-9add-6e6b83c0c350/is-the-stock-market-open.html?.tsrc=rss",
    "content": "Juneteenth—a portmanteau of “June nineteenth”—is here, a day characterized by parades and festivities across the U.S. But what does it mean for the market?  The Census Bureau released retail sales data on Tuesday, which came in weaker than expected.  On Wednesday, Federal Reserve officials opted to hold interest rates steady and forecast two rate cuts by the end of 2025.",
    "pubDate": "Thu, 19 Jun 2025 10:00:00 +0000"
  },
  {
    "title": "Nasdaq Announces Results from 2025 Annual Meeting of Shareholders",
    "link": "https://finance.yahoo.com/news/nasdaq-announces-results-2025-annual-203000779.html?.tsrc=rss",
    "content": "All 12 Nominated Directors Elected Nasdaq Board Re-elects Adena T. Friedman as Chair of the Board NEW YORK, June 16, 2025 (GLOBE NEWSWIRE) -- Nasdaq, Inc. (Nasdaq: NDAQ) shareholders elected all nominated directors at the company’s Annual Meeting of Shareholders on Wednesday, June 11, 2025. All directors will serve one-year terms. The elected board members are: Melissa M. Arnoldi, EVP and General Manager for Business Solutions, AT&T Inc.Charlene T. Begley, Retired SVP and CIO, General Electric C",
    "pubDate": "Mon, 16 Jun 2025 20:30:00 +0000"
  },
  {
    "title": "Delisting of Securities of Blue Star Foods Corp.; Altamira Therapeutics Ltd.; Evergreen Corporation; Fresh2 Group Limited; Coliseum Acquisition Corp.; The Real Good Food Company, Inc.; Mynaric AG; byNordic Acquisition Corporation; Avinger Inc.; MultiMetaVerse Holdings Limited; Nature's Miracle Holding Inc.; and SPI Energy Co., Ltd. from the Nasdaq Stock Market",
    "link": "https://finance.yahoo.com/news/delisting-securities-blue-star-foods-200500921.html?.tsrc=rss",
    "content": "NEW YORK, June 11, 2025 (GLOBE NEWSWIRE) -- The Nasdaq Stock Market announced today that it will delist the common stock of Blue Star Foods Corp. Blue Star Foods Corp.’s stock was suspended on December 20, 2024 and has not traded on Nasdaq since that time. Nasdaq also announced today that it will delist the common shares of Altamira Therapeutics Ltd. Altamira Therapeutics Ltd.’s stock was suspended on December 20, 2024 and has not traded on Nasdaq since that time. Nasdaq also announced today tha",
    "pubDate": "Wed, 11 Jun 2025 20:05:00 +0000"
  },
  {
    "title": "Nasdaq Announces End-of-Month Open Short Interest Positions in Nasdaq Stocks as of Settlement Date May 30, 2025",
    "link": "https://finance.yahoo.com/news/nasdaq-announces-end-month-open-200500276.html?.tsrc=rss",
    "content": "NEW YORK, June 10, 2025 (GLOBE NEWSWIRE) -- At the end of the settlement date of May 30, 2025, short interest in 3,184 Nasdaq Global MarketSM securities totaled 13,504,275,894 shares compared with 13,735,568,588 shares in 3,168 Global Market issues reported for the prior settlement date of May 15, 2025. The mid-May short interest represents 2.19 days compared with 2.41 days for the prior reporting period. Short interest in 1,632 securities on The Nasdaq Capital MarketSM totaled 2,610,068,615 sha",
    "pubDate": "Tue, 10 Jun 2025 20:05:00 +0000"
  },
  {
    "title": "Be Sure To Check Out Nasdaq, Inc. (NASDAQ:NDAQ) Before It Goes Ex-Dividend",
    "link": "https://finance.yahoo.com/news/sure-check-nasdaq-inc-nasdaq-193338411.html?.tsrc=rss",
    "content": "Readers hoping to buy Nasdaq, Inc. ( NASDAQ:NDAQ ) for its dividend will need to make their move shortly, as the stock...",
    "pubDate": "Tue, 10 Jun 2025 19:33:38 +0000"
  },
  {
    "title": "NDAQ Hits 52-Week High, Trades at a Discount: How to Play the Stock",
    "link": "https://finance.yahoo.com/news/ndaq-hits-52-week-high-132900988.html?.tsrc=rss",
    "content": "Nasdaq is set to grow on its increasing on-trading revenue base, impressive organic growth and investments in proprietary data, supported by a solid capital position.",
    "pubDate": "Mon, 09 Jun 2025 13:29:00 +0000"
  },
  {
    "title": "Nasdaq Launches Exclusive Access to Nasdaq Private Market’s Tape D® API to Deliver Advanced Visibility into Private Markets",
    "link": "https://finance.yahoo.com/news/nasdaq-launches-exclusive-access-nasdaq-143500506.html?.tsrc=rss",
    "content": "Real-Time Private Company Dataset Offers Critical Pricing and Valuation Insights for Private Companies, Investors, and AdvisorsNEW YORK, June 04, 2025 (GLOBE NEWSWIRE) -- Nasdaq® (Nasdaq: NDAQ) announced today that the company has partnered with Nasdaq Private Market (NPM), a leading provider of secondary liquidity solutions to private companies, employees, and investors, to provide greater price transparency and valuation visibility into private, pre-IPO companies, including unicorns and other",
    "pubDate": "Wed, 04 Jun 2025 14:35:00 +0000"
  },
  {
    "title": "Nasdaq Reports May 2025 Volumes",
    "link": "https://finance.yahoo.com/news/nasdaq-reports-may-2025-volumes-200500634.html?.tsrc=rss",
    "content": "NEW YORK, June 03, 2025 (GLOBE NEWSWIRE) -- Nasdaq (Nasdaq: NDAQ) today reported monthly volumes for May 2025 on its Investor Relations website. A data sheet showing this information can be found at: http://ir.nasdaq.com/financials/volume-statistics. About Nasdaq Nasdaq (Nasdaq: NDAQ) is a leading global technology company serving corporate clients, investment managers, banks, brokers, and exchange operators as they navigate and interact with the global capital markets and the broader financial",
    "pubDate": "Tue, 03 Jun 2025 20:05:00 +0000"
  },
  {
    "title": "Nasdaq's (NASDAQ:NDAQ) Shareholders Will Receive A Bigger Dividend Than Last Year",
    "link": "https://finance.yahoo.com/news/nasdaqs-nasdaq-ndaq-shareholders-receive-124944939.html?.tsrc=rss",
    "content": "Nasdaq, Inc. ( NASDAQ:NDAQ ) will increase its dividend from last year's comparable payment on the 27th of June to...",
    "pubDate": "Fri, 30 May 2025 12:49:44 +0000"
  },
  {
    "title": "Nasdaq Executives to Present at Upcoming Investor Conferences",
    "link": "https://finance.yahoo.com/news/nasdaq-executives-present-upcoming-investor-200500263.html?.tsrc=rss",
    "content": "NEW YORK, May 28, 2025 (GLOBE NEWSWIRE) -- Nasdaq (Nasdaq: NDAQ) will be presenting at the following conferences in June with webcasts available at Nasdaq’s Investor Relations website: ir.nasdaq.com/events.cfm. Who:Adena Friedman, Chair and CEO, NasdaqWhat:Piper Sandler Global Exchange & Trading ConferenceWhen:Thursday, June 5, 20252:30 PM ET Who:Tal Cohen, President, NasdaqWhat:Morgan Stanley US Financials ConferenceWhen:Tuesday, June 10, 20259:45 AM ET About Nasdaq Nasdaq (Nasdaq: NDAQ) is a g",
    "pubDate": "Wed, 28 May 2025 20:05:00 +0000"
  },
  {
    "title": "Nasdaq Announces Mid-Month Open Short Interest Positions in Nasdaq Stocks as of Settlement Date May 15, 2025",
    "link": "https://finance.yahoo.com/news/nasdaq-announces-mid-month-open-200500945.html?.tsrc=rss",
    "content": "NEW YORK, May 27, 2025 (GLOBE NEWSWIRE) -- At the end of the settlement date of May 15, 2025, short interest in 3,168 Nasdaq Global MarketSM securities totaled 13,735,568,588 shares compared with 13,300,707,903 shares in 3,156 Global Market issues reported for the prior settlement date of April 30, 2025. The mid-May short interest represents 2.41 days compared with 2.40 days for the prior reporting period. Short interest in 1,639 securities on The Nasdaq Capital MarketSM totaled 2,731,907,808 sh",
    "pubDate": "Tue, 27 May 2025 20:05:00 +0000"
  },
  {
    "title": "Delisting of Securities from The Nasdaq Stock Market",
    "link": "https://finance.yahoo.com/news/delisting-securities-nasdaq-stock-market-200500434.html?.tsrc=rss",
    "content": "Delisting of Securities of Bruush Oral Care Inc., IX Acquisition Corp., BAIYU Holdings, Inc., DUET Acquisition Corp., ENGlobal Corporation, Perception Capital Corp. III, Biora Therapeutics, Inc., Akoustis Technologies, Inc., iLearningEngines, Inc., Welsbach Technology Metals Acquisition Corp., Cartica Acquisition Corp, CSLM Acquisition Corp., Broad Capital Acquisition Corp, Technology & Telecommunication Acquisition Corporation, Western Acquisition Ventures Corp., Papaya Growth Opportunity Corp.",
    "pubDate": "Fri, 23 May 2025 20:05:00 +0000"
  },
  {
    "title": "Nasdaq (NasdaqGS:NDAQ) Enhances Philippine Infrastructure with New Eqlipse Trading Platform",
    "link": "https://finance.yahoo.com/news/nasdaq-nasdaqgs-ndaq-enhances-philippine-173848398.html?.tsrc=rss",
    "content": "Nasdaq (NasdaqGS:NDAQ) recently expanded its technology partnership with The Philippine Stock Exchange, enhancing its trading infrastructure with the advanced Nasdaq Eqlipse Trading platform. This move adds to the solid performance Nasdaq has showcased, reflected in a nearly 11% rise in its share price over the last month. The surge can be attributed to robust Q1 earnings, increased dividends, and strategic collaborations in Asia. These developments occur amidst a tech sector rally and...",
    "pubDate": "Thu, 22 May 2025 17:38:48 +0000"
  },
  {
    "title": "Philippine Stock Exchange Adopts Nasdaq Eqlipse Trading to Enhance Market Infrastructure",
    "link": "https://finance.yahoo.com/news/philippine-stock-exchange-adopts-nasdaq-090100075.html?.tsrc=rss",
    "content": "Nasdaq and The Philippine Stock Exchange Signing Ceremony Nasdaq President Tal Cohen and PSE President and CEO Ramon S. Monzon Upgrade to Nasdaq Eqlipse Trading will enhance liquidity and resilience of Philippine marketplace Expands Nasdaq’s deep technology footprint across the country’s financial services industry MANILA and NEW YORK, May 22, 2025 (GLOBE NEWSWIRE) -- Nasdaq (Nasdaq: NDAQ) and The Philippine Stock Exchange, Inc. (PSE) today announced a significant expansion of their technology p",
    "pubDate": "Thu, 22 May 2025 09:01:00 +0000"
  },
  {
    "title": "Thoma Bravo sold out of remaining 7% stake in Nasdaq, Bloomberg reports",
    "link": "https://finance.yahoo.com/news/thoma-bravo-sold-remaining-7-154548051.html?.tsrc=rss",
    "content": "Private equity firm Thoma Bravo divested around 43M shares, or about 7.4%, of Nasdaq (NDAQ) in unregistered block trades on May 7 and May 13, selling its remaining stake for proceeds of about $3.4B, people familiar with the matter told Bloomberg’s Ryan Gould and Anthony Hughes. The private equity firm worked with JPMorgan Chase (JPM) on the sale, according to the sources. Published first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>> See the top s",
    "pubDate": "Fri, 16 May 2025 15:45:48 +0000"
  },
  {
    "title": "Thoma Bravo Exits Nasdaq with $3.4B Finale -- And a Fat Paycheck",
    "link": "https://finance.yahoo.com/news/thoma-bravo-exits-nasdaq-3-184018072.html?.tsrc=rss",
    "content": "Private equity firm unloads final stake in Nasdaq after cashing in big on Adenza deal",
    "pubDate": "Thu, 15 May 2025 18:40:18 +0000"
  },
  {
    "title": "Africa Oil to Change Name to Meren Energy",
    "link": "https://finance.yahoo.com/news/africa-oil-change-name-meren-113201383.html?.tsrc=rss",
    "content": "Africa Oil (AOI.TO) on Thursday said it is changing its name to Meren Energy. The upstream oil an",
    "pubDate": "Thu, 15 May 2025 11:32:01 +0000"
  },
  {
    "title": "Nasdaq Announces 2025 Annual Meeting of Shareholders",
    "link": "https://finance.yahoo.com/news/nasdaq-announces-2025-annual-meeting-200500299.html?.tsrc=rss",
    "content": "NEW YORK, May 14, 2025 (GLOBE NEWSWIRE) -- Nasdaq, Inc. (Nasdaq: NDAQ) has scheduled its 2025 Annual Meeting of Shareholders for June 11, 2025, at 8:00 AM ET. The virtual meeting website can be accessed 15 minutes prior to the meeting start by visiting: www.virtualshareholdermeeting.com/NDAQ2025. Shareholders of record as of April 14, 2025 will be eligible to vote and participate in the Annual Meeting. Nasdaq’s 2025 Proxy Statement and 2024 Annual Report on Form 10-K are available at ir.nasdaq.c",
    "pubDate": "Wed, 14 May 2025 20:05:00 +0000"
  },
  {
    "title": "Nasdaq Applauds Signing of Senate Bill 29, Strengthening Texas’ Standing as a National Leader in Corporate Governance and Innovation",
    "link": "https://finance.yahoo.com/news/nasdaq-applauds-signing-senate-bill-191200202.html?.tsrc=rss",
    "content": "AUSTIN, Texas, May 14, 2025 (GLOBE NEWSWIRE) -- Today, Nasdaq issued a statement in support of Texas Senate Bill 29 after Governor Abbott signed the bill into law. This legislation, which codifies the Business Judgment Rule and promotes predictability in corporate governance litigation, enhances Texas’ competitiveness as a jurisdiction for incorporation and business growth. Nasdaq's Executive Vice Chairman Ed Knight joined Governor Abbott, leadership from the Texas legislature, and other Texas b",
    "pubDate": "Wed, 14 May 2025 19:12:00 +0000"
  },
  {
    "title": "Fincom Announces Series B Financing Led by Nasdaq Ventures with Participation from Macquarie Group and G1 Ventures",
    "link": "https://finance.yahoo.com/news/fincom-announces-series-b-financing-130000087.html?.tsrc=rss",
    "content": "Fincom, a leader in anti-money laundering (AML) Sanction Screening and Entity Resolution technology, today announced the successful completion of its Series B funding round, securing a strategic investment led by Nasdaq Ventures, with participation from Macquarie Group, G1 Ventures, and existing investors including AnD Ventures and ff Venture Capital. This investment marks a significant milestone in Fincom's growth journey and underscores confidence in its vision and market potential.",
    "pubDate": "Tue, 13 May 2025 13:00:00 +0000"
  },
  {
    "title": "Bull of the Day: Manchester United (MANU)",
    "link": "https://finance.yahoo.com/news/bull-day-manchester-united-manu-153700716.html?.tsrc=rss",
    "content": "It is not that often that we see a professional sports team be a public company but that is just what MANU is.",
    "pubDate": "Thu, 12 Jun 2025 15:37:00 +0000"
  },
  {
    "title": "Manchester United (MANU) Upgraded to Strong Buy: Here's What You Should Know",
    "link": "https://finance.yahoo.com/news/manchester-united-manu-upgraded-strong-160003120.html?.tsrc=rss",
    "content": "Manchester United (MANU) might move higher on growing optimism about its earnings prospects, which is reflected by its upgrade to a Zacks Rank #1 (Strong Buy).",
    "pubDate": "Wed, 11 Jun 2025 16:00:03 +0000"
  },
  {
    "title": "Does Manchester United (MANU) Have the Potential to Rally 29.16% as Wall Street Analysts Expect?",
    "link": "https://finance.yahoo.com/news/does-manchester-united-manu-potential-135508699.html?.tsrc=rss",
    "content": "The mean of analysts' price targets for Manchester United (MANU) points to a 29.2% upside in the stock. While this highly sought-after metric has not proven reasonably effective, strong agreement among analysts in raising earnings estimates does indicate an upside in the stock.",
    "pubDate": "Wed, 11 Jun 2025 13:55:08 +0000"
  },
  {
    "title": "Company News for Jun 9, 2025",
    "link": "https://finance.yahoo.com/news/company-news-jun-9-2025-080900726.html?.tsrc=rss",
    "content": "Companies In The News Are: MANU, GIII, ABM, LULU.",
    "pubDate": "Mon, 09 Jun 2025 08:09:00 +0000"
  },
  {
    "title": "Docusign, Manchester United, Petco: Trending Tickers",
    "link": "https://finance.yahoo.com/video/docusign-manchester-united-petco-trending-193343802.html?.tsrc=rss",
    "content": "Docusign (DOCU) shares drop lower in Friday's trading session after reporting that first quarter billings fell short of expectations while topping revenue estimates. British soccer club Manchester United (MANU) is seeing its stock soar after lifting its adjusted EBITDA full-year forecast. Pet retailer Petco (WOOF) sank by over 20% after missing its quarterly sales forecasts as its comparable sales saw wider-than-expected declines tied to tariffs. To watch more expert insights and analysis on the latest market action, check out more Market Domination here.",
    "pubDate": "Fri, 06 Jun 2025 19:33:43 +0000"
  },
  {
    "title": "Manchester United Stock Pops as Deep Europa League Run Fuels Revenue Gains",
    "link": "https://www.investopedia.com/manchester-united-stock-pops-as-deep-europa-league-run-fuels-revenue-gains-11749808?.tsrc=rss",
    "content": "Manchester United had a disappointing 2024-25 Premier League campaign. Its deep UEFA Europa League run, however, led to better-than-expected revenue gains in the fiscal third quarter.",
    "pubDate": "Fri, 06 Jun 2025 17:20:28 +0000"
  },
  {
    "title": "Walmart drones, Manchester United EBITDA, Petco sales miss",
    "link": "https://finance.yahoo.com/video/walmart-drones-manchester-united-ebitda-161257290.html?.tsrc=rss",
    "content": "Yahoo Finance host Brad Smith tracks today's top moving stocks and biggest market stories in this Market Minute, including Walmart's (WMT) plans to expand its drone deliveries to three new states, British soccer club Manchester United (MANU) lifting its adjusted EBITDA outlook, and Petco (WOOF) missing comparable sales estimates for its first quarter. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
    "pubDate": "Fri, 06 Jun 2025 16:12:57 +0000"
  },
  {
    "title": "Manchester United Aims to Finish Fiscal 2025 at High End of Tightened Revenue Guidance",
    "link": "https://finance.yahoo.com/news/manchester-united-aims-finish-fiscal-145916978.html?.tsrc=rss",
    "content": "Manchester United (MANU) shares soared intraday Friday after the British soccer club said it expects",
    "pubDate": "Fri, 06 Jun 2025 14:59:16 +0000"
  },
  {
    "title": "Manchester United (MANU) Reports Q3 Loss, Misses Revenue Estimates",
    "link": "https://finance.yahoo.com/news/manchester-united-manu-reports-q3-121502584.html?.tsrc=rss",
    "content": "Manchester United (MANU) delivered earnings and revenue surprises of 87.88% and 0.15%, respectively, for the quarter ended March 2025. Do the numbers hold clues to what lies ahead for the stock?",
    "pubDate": "Fri, 06 Jun 2025 12:15:02 +0000"
  },
  {
    "title": "Manchester United: Fiscal Q3 Earnings Snapshot",
    "link": "https://finance.yahoo.com/news/manchester-united-fiscal-q3-earnings-111502931.html?.tsrc=rss",
    "content": "MANCHESTER, Britain (AP) — Manchester United PLC (MANU) on Friday reported a loss of $3.4 million in its fiscal third quarter. The Manchester, Britain-based company said it had a loss of 2 cents per share. Losses, adjusted for non-recurring gains, came to 4 cents per share.",
    "pubDate": "Fri, 06 Jun 2025 11:15:02 +0000"
  },
  {
    "title": "Manchester United expects annual core profit to return to pre-COVID levels",
    "link": "https://finance.yahoo.com/news/manchester-united-boost-profit-forecast-111124581.html?.tsrc=rss",
    "content": "(Reuters) -Manchester United raised their annual core profit forecast on Friday to levels last seen before the pandemic as the club's strong performance in the Europa League drove ticket sales and broadcast revenue.  Ticket sales jumped more than 50% to 44.5 million pounds in the three months to March as the club had a good run in the Europa League, before losing the finals to Tottenham Hotspur.  United's New York-listed shares rose 4.4% in U.S. premarket trading.",
    "pubDate": "Fri, 06 Jun 2025 11:11:24 +0000"
  },
  {
    "title": "Manchester United Plc Reports Third Quarter Fiscal 2025 Results",
    "link": "https://finance.yahoo.com/news/manchester-united-plc-reports-third-110000825.html?.tsrc=rss",
    "content": "MANCHESTER, England, June 06, 2025--Manchester United (NYSE: MANU; the \"Company,\" the \"Group\" and the \"Club\") today announced financial results for the 2025 fiscal third quarter ended 31 March 2025.",
    "pubDate": "Fri, 06 Jun 2025 11:00:00 +0000"
  },
  {
    "title": "Vail Resorts (MTN) Beats Q3 Earnings Estimates",
    "link": "https://finance.yahoo.com/news/vail-resorts-mtn-beats-q3-211505831.html?.tsrc=rss",
    "content": "Vail Resorts (MTN) delivered earnings and revenue surprises of 5.40% and 0.55%, respectively, for the quarter ended April 2025. Do the numbers hold clues to what lies ahead for the stock?",
    "pubDate": "Thu, 05 Jun 2025 21:15:05 +0000"
  },
  {
    "title": "Manchester United plc Announces Third Quarter Fiscal 2025 Earnings Report Date",
    "link": "https://finance.yahoo.com/news/manchester-united-plc-announces-third-110000772.html?.tsrc=rss",
    "content": "MANCHESTER, England, May 30, 2025--Manchester United plc (NYSE: MANU), announces that it will report results for the third quarter fiscal 2025 period ended 31 March 2025 via press release on 6 June 2025 at 7:00 AM ET.",
    "pubDate": "Fri, 30 May 2025 11:00:00 +0000"
  },
  {
    "title": "Sports Park Promoters Plead Guilty to $280 Million Bond Fraud",
    "link": "https://finance.yahoo.com/news/sports-park-promoters-plead-guilty-172917610.html?.tsrc=rss",
    "content": "(Bloomberg) -- A father and son from Phoenix pleaded guilty to defrauding several of the nation’s biggest investment firms about the business prospects of a failed Arizona sports complex that wound up costing municipal bondholders more than $280 million. Most Read from BloombergNYC Congestion Toll Brings In $216 Million in First Four MonthsNY Wins Order Against US Funding Freeze in Congestion FightNY Congestion Pricing Is Likely to Stay Until Year End During Court CaseRandy Miller, 70, and his s",
    "pubDate": "Wed, 28 May 2025 17:29:17 +0000"
  },
  {
    "title": "Sir Jim Ratcliffe sees net worth plunge by reported $8.7 billion as Ineos fights chemicals ‘extinction’",
    "link": "https://finance.yahoo.com/news/sir-jim-ratcliffe-sees-net-101644418.html?.tsrc=rss",
    "content": "The Ineos billionaire has faced struggles turning around Ineos and his pet project, Manchester United.",
    "pubDate": "Fri, 16 May 2025 10:16:44 +0000"
  },
  {
    "title": "Man Utd co-owner Sir Jim Ratcliffe’s wealth falls by over £6 billion",
    "link": "https://www.independent.co.uk/news/business/jim-ratcliffe-manchester-united-wealth-rich-list-b2752210.html?.tsrc=rss",
    "content": "The 72-year-old has seen his fortune reduced to £17 billion",
    "pubDate": "Fri, 16 May 2025 08:08:28 +0000"
  },
  {
    "title": "No sign of any U-turn on match-day parking scam near Old Trafford",
    "link": "https://uk.finance.yahoo.com/news/no-sign-u-turn-match-073014371.html?.tsrc=rss",
    "content": "A £10 cash payment to fake parking stewards led to a real £170 penalty charge notice for one fan",
    "pubDate": "Mon, 07 Apr 2025 07:30:14 +0000"
  },
  {
    "title": "Jim Ratcliffe’s Ineos recalls cars after doors open while driving",
    "link": "https://uk.finance.yahoo.com/news/sir-jim-ratcliffe-ineos-recalls-060000668.html?.tsrc=rss",
    "content": "Sir Jim Ratcliffe’s car company has been forced to recall SUVs in the US after customers complained that doors were flying open while driving.",
    "pubDate": "Thu, 13 Mar 2025 06:00:00 +0000"
  },
  {
    "title": "Manchester United plans new $2.58bn stadium in Old Trafford",
    "link": "https://www.worldconstructionnetwork.com/news/manchester-united-plans-new-2-58bn-stadium-trafford/?.tsrc=rss",
    "content": "The development could potentially create 92,000 new jobs and more than 17,000 new homes.",
    "pubDate": "Wed, 12 Mar 2025 10:06:41 +0000"
  },
  {
    "title": "The Best Stocks to Invest $1,000 in Right Now",
    "link": "https://www.fool.com/investing/2025/06/23/the-best-stocks-to-invest-1000-in-right-now/?.tsrc=rss",
    "content": "Nvidia has grown its revenue for nine consecutive quarters and currently has a 92% share of the GPU market.  AppLovin's AI tools and performance-based business model are impressing advertisers.  Few AI companies have been as successful as Nvidia (NASDAQ: NVDA), which develops the graphics processing units (GPUs) that provide the specific type of processing power that advanced AI applications need most.",
    "pubDate": "Tue, 24 Jun 2025 00:15:00 +0000"
  },
  {
    "title": "Digital Payment Today - Africa's Digital Wallet Market Poised for Significant Growth",
    "link": "https://finance.yahoo.com/news/digital-payment-today-africas-digital-123736005.html?.tsrc=rss",
    "content": "Africa's prepaid card and digital wallet market is projected to experience significant growth, with forecasts indicating a compound annual growth rate (CAGR) of 13.3% from 2025 to 2029, reaching an estimated value of $59.4 billion by 2029. This expansion is primarily driven by increased digital adoption, financial inclusion initiatives, and the integration of mobile money platforms, which collectively enhance access to financial services for unbanked populations. The rise of prepaid card...",
    "pubDate": "Mon, 23 Jun 2025 12:37:36 +0000"
  },
  {
    "title": "Chime versus SoFi: Which Is the Better Fintech Stock Right Now?",
    "link": "https://www.fool.com/investing/2025/06/22/chime-versus-sofi-which-is-the-better-fintech-stoc/?.tsrc=rss",
    "content": "Chime and SoFi are two emerging stars in the fintech space.",
    "pubDate": "Sun, 22 Jun 2025 08:45:00 +0000"
  },
  {
    "title": "Where Will SoFi Be in 3 Years?",
    "link": "https://www.fool.com/investing/2025/06/21/where-will-sofi-be-in-3-years/?.tsrc=rss",
    "content": "The online bank recently raised its revenue guidance for 2025.  The share price of SoFi Technologies (NASDAQ: SOFI), an online bank and leading financial technology (fintech) company, has more than doubled over the past year.  The San Francisco-based company has done a great job of expanding its services to appeal to a wider consumer base, which in turn has pushed sales and earnings -- along with SoFi's stock price -- higher.",
    "pubDate": "Sat, 21 Jun 2025 13:35:00 +0000"
  },
  {
    "title": "SoFi Technologies (NasdaqGS:SOFI) Partners With Benzinga To Enhance Investor Insights",
    "link": "https://finance.yahoo.com/news/sofi-technologies-nasdaqgs-sofi-partners-173323895.html?.tsrc=rss",
    "content": "SoFi Technologies (NasdaqGS:SOFI) has experienced a notable share price increase of 20% over the past month. This significant movement aligns with the announcement of a new partnership with Benzinga, which aims to enhance SoFi Invest members' access to premium market insights and research tools. While the broader market saw little change, with fluctuations in oil prices and geopolitical tensions influencing mixed trading outcomes, SoFi's strategic initiative likely added positive momentum to...",
    "pubDate": "Fri, 20 Jun 2025 17:33:23 +0000"
  },
  {
    "title": "After a 142% Rise, Can SoFi Stock Keep Climbing?",
    "link": "https://www.barchart.com/story/news/32975181/after-a-142-rise-can-sofi-stock-keep-climbing?.tsrc=rss",
    "content": "SoFi is delivering exceptional growth, driven by rapid member acquisition, strong revenue expansion, and a strategic shift toward capital-light, high-margin businesses.",
    "pubDate": "Fri, 20 Jun 2025 14:55:23 +0000"
  },
  {
    "title": "SoFi and Benzinga Announce New Partnership to Power Next-Generation Investment Research",
    "link": "https://finance.yahoo.com/news/sofi-benzinga-announce-partnership-power-110000592.html?.tsrc=rss",
    "content": "/ Benzinga / – Benzinga, the largest financial news provider in North America, is excited to announce a new partnership with SoFi to bring powerful market insights and institutional-grade research tools directly to SoFi Invest members.",
    "pubDate": "Fri, 20 Jun 2025 11:00:00 +0000"
  },
  {
    "title": "Will SoFi Reach a New All-Time High Before the End of 2025?",
    "link": "https://www.fool.com/investing/2025/06/20/will-sofi-reach-a-new-all-time-high-before-the-end/?.tsrc=rss",
    "content": "More recently, SoFi peaked at $18.42 in January, after several years of largely being ignored by the market.  If SoFi’s business proves resilient in a challenging economic climate, it could certainly reach a new 52-week high.  By virtually every metric, SoFi is a far stronger business today than it was back then.",
    "pubDate": "Fri, 20 Jun 2025 10:42:00 +0000"
  },
  {
    "title": "SoFi Technologies (SOFI) Upgraded to Buy: Here's Why",
    "link": "https://finance.yahoo.com/news/sofi-technologies-sofi-upgraded-buy-160003584.html?.tsrc=rss",
    "content": "SoFi Technologies (SOFI) has been upgraded to a Zacks Rank #2 (Buy), reflecting growing optimism about the company's earnings prospects. This might drive the stock higher in the near term.",
    "pubDate": "Thu, 19 Jun 2025 16:00:03 +0000"
  },
  {
    "title": "Investors Heavily Search SoFi Technologies, Inc. (SOFI): Here is What You Need to Know",
    "link": "https://finance.yahoo.com/news/investors-heavily-search-sofi-technologies-130002798.html?.tsrc=rss",
    "content": "SoFi Technologies (SOFI) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock.",
    "pubDate": "Thu, 19 Jun 2025 13:00:02 +0000"
  },
  {
    "title": "2 Bank Stocks to Buy With $100 and Hold Forever",
    "link": "https://www.fool.com/investing/2025/06/18/2-bank-stocks-to-buy-with-100-and-hold/?.tsrc=rss",
    "content": "Bank of America is a stable banking giant growing at healthy rates.  Bank stocks are a very specific category that stands out in a number of ways.  Bank stocks are typically cash-rich and well-established, and they often pay dividends.",
    "pubDate": "Wed, 18 Jun 2025 08:00:00 +0000"
  },
  {
    "title": "SoFi Technologies, Inc. (SOFI) Registers a Bigger Fall Than the Market: Important Facts to Note",
    "link": "https://finance.yahoo.com/news/sofi-technologies-inc-sofi-registers-214502116.html?.tsrc=rss",
    "content": "SoFi Technologies, Inc. (SOFI) closed at $14.43 in the latest trading session, marking a -3.15% move from the prior day.",
    "pubDate": "Tue, 17 Jun 2025 21:45:02 +0000"
  },
  {
    "title": "Prediction: This Stock Could Beat the Market in the Next Decade",
    "link": "https://www.fool.com/investing/2025/06/17/prediction-this-stock-could-beat-the-market-in-the/?.tsrc=rss",
    "content": "If you had bought shares of SoFi Technologies (NASDAQ: SOFI) a year ago, you'd be sitting pretty right now.  Despite SoFi's strong performance over the past year, it hasn't followed a straight, northbound path.  True, the company performed well in 2024.",
    "pubDate": "Tue, 17 Jun 2025 07:32:00 +0000"
  },
  {
    "title": "Galileo Transforms SoFi Into the Backbone of Embedded Finance",
    "link": "https://finance.yahoo.com/news/galileo-transforms-sofi-backbone-embedded-175500274.html?.tsrc=rss",
    "content": "Galileo is driving SOFI's B2B expansion as embedded finance grows fast. Can this platform reshape digital banking?",
    "pubDate": "Mon, 16 Jun 2025 17:55:00 +0000"
  },
  {
    "title": "Digital Payment Update - Open Banking Fuels Fintech Surge in the Middle East",
    "link": "https://finance.yahoo.com/news/digital-payment-open-banking-fuels-123738811.html?.tsrc=rss",
    "content": "Recent developments in digital payment integration highlight the transformative impact of Open Banking in the Middle East, as detailed in a new white paper by TPAY MOBILE. The document emphasizes how innovative financial technologies, coupled with updated licensing and increased investment, are spurring rapid fintech growth in the region. Despite relatively lower valuations compared to Western markets, the Middle East's strategic position and Open Banking's potential to create seamless...",
    "pubDate": "Mon, 16 Jun 2025 12:37:38 +0000"
  },
  {
    "title": "Here Are My Top 2 Growth Stocks to Buy Now",
    "link": "https://www.fool.com/investing/2025/06/16/here-are-my-top-2-growth-stocks-to-buy-now/?.tsrc=rss",
    "content": "With the market just starting to get back into positive territory for the year, and many companies dealing with macroeconomic and policy impacts, can you find growth stocks to buy?  You only have to take a look at what billionaire investors like Warren Buffett are doing to see that there are great stocks to buy today whatever your investing strategy.  Most individual portfolios should have a mix of growth stocks and value stocks in addition to other categories and be diversified across size and industry.",
    "pubDate": "Mon, 16 Jun 2025 10:30:00 +0000"
  },
  {
    "title": "Where Will SoFi Be in 5 Years?",
    "link": "https://www.fool.com/investing/2025/06/13/where-will-sofi-be-in-5-years/?.tsrc=rss",
    "content": "Its growth has been noteworthy, but management must maintain focus on product innovation and risk management.  Given the trajectory of earnings per share, the stock has sizable upside.  This leading digital bank hardly flies under the radar anymore.",
    "pubDate": "Fri, 13 Jun 2025 12:15:00 +0000"
  },
  {
    "title": "New SoFi Report Uncovers the Biggest Challenge in Financing Higher Education: Understanding the True Cost",
    "link": "https://finance.yahoo.com/news/sofi-report-uncovers-biggest-challenge-180500236.html?.tsrc=rss",
    "content": "SAN FRANCISCO, June 12, 2025--New SoFi Report Uncovers the Biggest Challenge in Financing Higher Education: Understanding the True Cost",
    "pubDate": "Thu, 12 Jun 2025 18:05:00 +0000"
  },
  {
    "title": "SoFi Technologies (NasdaqGS:SOFI) Revenue Rises To US$764 Million In Q1 2025 Earnings",
    "link": "https://finance.yahoo.com/news/sofi-technologies-nasdaqgs-sofi-revenue-175156216.html?.tsrc=rss",
    "content": "SoFi Technologies (NasdaqGS:SOFI) experienced a price increase of 32% over the last quarter. The company's Q1 2025 earnings results revealed a revenue rise to $764 million, although net income fell to $71 million. The launch of the SmartStart Refinance Option may have spurred investor interest, providing loan flexibility for members. Meanwhile, the addition of private market funds offers potential for accredited investors. Corporate governance updates, including the upcoming AGM, provided...",
    "pubDate": "Thu, 12 Jun 2025 17:51:56 +0000"
  },
  {
    "title": "SoFi Stock Surges 32% in 3 Months: Buying Opportunity Still Exists?",
    "link": "https://finance.yahoo.com/news/sofi-stock-surges-32-3-171200110.html?.tsrc=rss",
    "content": "SOFI jumps 32% in 3 months, but valuation concerns and macro risks raise questions about near-term buying potential.",
    "pubDate": "Thu, 12 Jun 2025 17:12:00 +0000"
  },
  {
    "title": "HCLTech and AMD forge strategic alliance to develop future-ready solutions across AI, digital and cloud",
    "link": "https://finance.yahoo.com/news/hcltech-amd-forge-strategic-alliance-103300609.html?.tsrc=rss",
    "content": "HCLTech (NSE: HCLTECH.NS) (BSE: HCLTECH.BO), a leading global technology company, and AMD (NASDAQ: AMD), a leader in high-performance and adaptive computing, have announced a strategic alliance to accelerate enterprise digital transformation worldwide through advanced solutions in AI, digital and cloud.",
    "pubDate": "Tue, 24 Jun 2025 10:33:00 +0000"
  },
  {
    "title": "Stock Index Futures Rally on Israel-Iran Truce Optimism, U.S. Economic Data and Powell’s Testimony on Tap",
    "link": "https://www.barchart.com/story/news/33017125/stock-index-futures-rally-on-israel-iran-truce-optimism-u-s-economic-data-and-powells-testimony-on-tap?.tsrc=rss",
    "content": "September S&P 500 E-Mini futures (ESU25) are up +0.87%, and September Nasdaq 100 E-Mini futures (NQU25) are up +1.15% this morning as sentiment got a boost after U.S. President Donald Trump announced a ceasefire between Israel and Iran.",
    "pubDate": "Tue, 24 Jun 2025 10:03:02 +0000"
  },
  {
    "title": "Prediction: 3 Stocks That Will Be Worth More Than Palantir 3 Years From Now",
    "link": "https://www.fool.com/investing/2025/06/24/prediction-3-stocks-that-will-be-worth-more-than-p/?.tsrc=rss",
    "content": "Palantir is valued among companies that are much larger than it.  Salesforce, ASML, and AMD will likely be larger than Palantir in the near future.  Palantir Technologies (NASDAQ: PLTR) is one of the most popular artificial intelligence (AI) stocks on the market, but it got that way by having a ton of hype baked into the stock.",
    "pubDate": "Tue, 24 Jun 2025 09:30:00 +0000"
  },
  {
    "title": "Billionaire David Tepper Sold 97% of Appaloosa's Nvidia Stake and His Entire Position in AMD in Favor of This Trillion-Dollar Artificial Intelligence (AI) Stock",
    "link": "https://www.fool.com/investing/2025/06/24/billionaire-david-tepper-sold-nvidia-amd-ai-stock/?.tsrc=rss",
    "content": "Appaloosa's billionaire chief appears to be shifting his focus within the artificial intelligence (AI) arena.",
    "pubDate": "Tue, 24 Jun 2025 07:06:00 +0000"
  },
  {
    "title": "1 Cash-Heavy Stock with Promising Prospects and 2 to Steer Clear Of",
    "link": "https://finance.yahoo.com/news/1-cash-heavy-stock-promising-043413758.html?.tsrc=rss",
    "content": "A cash-heavy balance sheet is often a sign of strength, but not always. Some companies avoid debt because they have weak business models, limited expansion opportunities, or inconsistent cash flow.",
    "pubDate": "Tue, 24 Jun 2025 04:34:13 +0000"
  },
  {
    "title": "The Best Stocks to Invest $1,000 in Right Now",
    "link": "https://www.fool.com/investing/2025/06/23/the-best-stocks-to-invest-1000-in-right-now/?.tsrc=rss",
    "content": "Nvidia has grown its revenue for nine consecutive quarters and currently has a 92% share of the GPU market.  AppLovin's AI tools and performance-based business model are impressing advertisers.  Few AI companies have been as successful as Nvidia (NASDAQ: NVDA), which develops the graphics processing units (GPUs) that provide the specific type of processing power that advanced AI applications need most.",
    "pubDate": "Tue, 24 Jun 2025 00:15:00 +0000"
  },
  {
    "title": "AMD Stock Gets New Buy Rating As AI Efforts Take Hold",
    "link": "https://finance.yahoo.com/m/2bbdecb4-82d9-3431-87f0-f9b44166d980/amd-stock-gets-new-buy-rating.html?.tsrc=rss",
    "content": "Advanced Micro Devices has turned a Wall Street skeptic into a bull with its progress in artificial intelligence chips and computing systems.",
    "pubDate": "Mon, 23 Jun 2025 20:30:06 +0000"
  },
  {
    "title": "AMD, Keysight Technologies Collaborate to Develop PCIe 6.0 for High-Speed AI Applications",
    "link": "https://finance.yahoo.com/news/amd-keysight-technologies-collaborate-develop-200329267.html?.tsrc=rss",
    "content": "Advanced Micro Devices Inc. (NASDAQ:AMD) is one of the best QQQ stocks to buy according to hedge funds. On June 18, AMD partnered with Keysight Technologies Inc. (NYSE:KEYS) to advance PCI Express/PCIe 6.0 technology, which is a crucial step for high-speed data transfer and AI application development. The collaboration involves Keysight providing early access to […]",
    "pubDate": "Mon, 23 Jun 2025 20:03:29 +0000"
  },
  {
    "title": "Microsoft, AMD Partner to Co-Engineer Custom Silicon for Next-Gen Xbox Consoles",
    "link": "https://finance.yahoo.com/news/microsoft-amd-partner-co-engineer-193736770.html?.tsrc=rss",
    "content": "Microsoft Corporation (NASDAQ:MSFT) is one of the best QQQ stocks to buy according to hedge funds. On June 18, Microsoft and Advanced Micro Devices Inc. (NASDAQ:AMD) announced a multi-year agreement to co-engineer custom silicon for a range of devices, such as Microsoft’s next-generation Xbox consoles. The partnership aims to enhance visual quality, immersive gameplay, and […]",
    "pubDate": "Mon, 23 Jun 2025 19:37:36 +0000"
  },
  {
    "title": "Why AMD Stock Is Rising Today",
    "link": "https://www.fool.com/investing/2025/06/23/why-amd-stock-is-rising-today/?.tsrc=rss",
    "content": "AMD's share price is rising today thanks to bullish momentum for the broader market and positive analyst coverage.  Melius raised its rating on AMD stock from hold to buy and increased its one-year price target from $110 per share to $175 per share.  Advanced Micro Devices (NASDAQ: AMD) stock has moved higher in Monday's trading despite giving up some of its early gains.",
    "pubDate": "Mon, 23 Jun 2025 19:25:09 +0000"
  },
  {
    "title": "Cathie Wood Pours Millions into AMD, Dumps Circle After 650% Surge",
    "link": "https://finance.yahoo.com/news/cathie-wood-pours-millions-amd-183808915.html?.tsrc=rss",
    "content": "Cathie Wood Bets Bigger on AMD, Bails on Booming Circle Internet",
    "pubDate": "Mon, 23 Jun 2025 18:38:08 +0000"
  },
  {
    "title": "Super Micro, AMD upgrade, Apple & AI: Trending Tickers",
    "link": "https://finance.yahoo.com/video/super-micro-amd-upgrade-apple-163213761.html?.tsrc=rss",
    "content": "Super Micro Computer (SMCI) stock falls after the company announced that it is offering $2 billion in convertible notes. Advanced Micro Devices (AMD) received an upgrade from Melius to Buy from Hold and an increased price target from the firm to $175. Apple (AAPL) is reportedly considering acquiring artificial intelligence (AI) startup Perplexity (PEAI.PVT), according to reports from Bloomberg. To watch more expert insights and analysis on the latest market action, check out more Market Catalysts here.",
    "pubDate": "Mon, 23 Jun 2025 16:32:13 +0000"
  },
  {
    "title": "AMD Rolls Out Next-Gen AI Chips, But Market Treads Carefully",
    "link": "https://finance.yahoo.com/news/amd-rolls-next-gen-ai-161941503.html?.tsrc=rss",
    "content": "AMD (NASDAQ:AMD) unveiled a major advance in its AI hardware roadmap in mid-June. The company introduced the Instinct MI350 accelerator series and offered a preview of the MI400 lineup expected in 2026. AMD (NASDAQ:AMD) also revealed its new Helios AI server platform, which seeks to deliver a full-stack alternative to Nvidia’s dominant infrastructure. The MI350 […]",
    "pubDate": "Mon, 23 Jun 2025 16:19:41 +0000"
  },
  {
    "title": "Will FPGA Advancement Revive AMD's Embedded Segment Revenues?",
    "link": "https://finance.yahoo.com/news/fpga-advancement-revive-amds-embedded-152800082.html?.tsrc=rss",
    "content": "Advanced Micro Devices leans on Xilinx-driven FPGA advances and cloud partnerships to revive momentum in its Embedded segment.",
    "pubDate": "Mon, 23 Jun 2025 15:28:00 +0000"
  },
  {
    "title": "Stocks Climb on Strong US Economic Reports and Dovish Fed Comments",
    "link": "https://www.barchart.com/story/news/33004687/stocks-climb-on-strong-us-economic-reports-and-dovish-fed-comments?.tsrc=rss",
    "content": "The S&P 500 Index ($SPX ) (SPY ) today is up +0.43%, the Dow Jones Industrials Index ($DOWI ) (DIA ) is up +0.20%, and the Nasdaq 100 Index ($IUXX ) (QQQ ) is up +0.60%. September E-mini S&P futures (ESU25 ) are up +0.50%, and September E-mini Nasdaq futures...",
    "pubDate": "Mon, 23 Jun 2025 15:22:20 +0000"
  },
  {
    "title": "Intel vs. NVIDIA: Which AI-Focused Chip Stock is the Better Buy?",
    "link": "https://finance.yahoo.com/news/intel-vs-nvidia-ai-focused-143300899.html?.tsrc=rss",
    "content": "NVIDIA's AI-driven growth outpaces Intel's, but a lower valuation keeps INTC in the race for investor attention.",
    "pubDate": "Mon, 23 Jun 2025 14:33:00 +0000"
  },
  {
    "title": "AMD Stock Pops. The Case to Buy as It Competes With Nvidia on AI Chips.",
    "link": "https://finance.yahoo.com/m/5868546d-519c-3802-93ce-b7b32d2510fd/amd-stock-pops.-the-case-to.html?.tsrc=rss",
    "content": "New AI chips should help the company carve out a lasting niche in the market, according to Melius Research.",
    "pubDate": "Mon, 23 Jun 2025 14:23:00 +0000"
  },
  {
    "title": "Stocks See Support on Speculation Iran's Retaliation Will Be Limited",
    "link": "https://www.barchart.com/story/news/33003523/stocks-see-support-on-speculation-iran-s-retaliation-will-be-limited?.tsrc=rss",
    "content": "The S&P 500 Index ($SPX ) (SPY ) today is up +0.14%, the Dow Jones Industrials Index ($DOWI ) (DIA ) is up +0.05%, and the Nasdaq 100 Index ($IUXX ) (QQQ ) is up +0.03%. September E-mini S&P futures (ESU25 ) are up +0.20%, and September E-mini Nasdaq futures...",
    "pubDate": "Mon, 23 Jun 2025 14:18:37 +0000"
  },
  {
    "title": "AMD Stock Rises After Analyst Calls It the Next Big AI Winner",
    "link": "https://finance.yahoo.com/news/amd-stock-rises-analyst-calls-141708034.html?.tsrc=rss",
    "content": "AMD Stock Gets Boost as Melius Sees 'Historic Run' Ahead",
    "pubDate": "Mon, 23 Jun 2025 14:17:08 +0000"
  },
  {
    "title": "Melius upgrades AMD shares to Buy, says the stock ’has a lot more to go’",
    "link": "https://finance.yahoo.com/news/melius-upgrades-amd-shares-buy-140424540.html?.tsrc=rss",
    "content": "Investing.com -- Melius Research upgraded shares of Advanced Micro Devices (NASDAQ:AMD) to Buy from Hold, a move driven by growing confidence in the chipmaker’s positioning in the AI inferencing market.",
    "pubDate": "Mon, 23 Jun 2025 14:04:24 +0000"
  },
  {
    "title": "There Are Currently Better Options Than Microsoft",
    "link": "https://finance.yahoo.com/news/currently-better-options-microsoft-093720326.html?.tsrc=rss",
    "content": "The reason other Mag-7 stocks are more attractive at the moment.",
    "pubDate": "Tue, 24 Jun 2025 09:37:20 +0000"
  },
  {
    "title": "Stock-Split Watch: Is This AI Stock That's Soared 300% Next on the List?",
    "link": "https://www.fool.com/investing/2025/06/24/stock-split-watch-is-this-ai-stock-thats-soared-30/?.tsrc=rss",
    "content": "Only one \"Magnificent Seven\" company hasn’t yet split its stock.  Stock splits make it easier for a broader range of investors to buy the shares.  Stock splits have fascinated investors over the past few years, with even the biggest artificial intelligence (AI) names -- such as Nvidia and Amazon -- completing such operations after their stock prices skyrocketed.",
    "pubDate": "Tue, 24 Jun 2025 08:10:00 +0000"
  },
  {
    "title": "Update: Market Chatter: US House Bans Meta's WhatsApp From Government Devices on Security Concerns",
    "link": "https://finance.yahoo.com/news/market-chatter-us-house-bans-203846671.html?.tsrc=rss",
    "content": "(Updates with US chief administrative officer's response in the sixth and seventh paragraphs.) Th",
    "pubDate": "Mon, 23 Jun 2025 20:38:46 +0000"
  },
  {
    "title": "AI Giants Nvidia, Meta And More Fuel This Power-Play Breakout",
    "link": "https://finance.yahoo.com/m/fef929d0-3742-3c54-8d81-19143dffff86/ai-giants-nvidia%2C-meta-and.html?.tsrc=rss",
    "content": "As AI leaders like Nvidia and Meta drive demand for data centers, Vistra provides the needed fuel and powers a breakout.",
    "pubDate": "Mon, 23 Jun 2025 20:00:06 +0000"
  },
  {
    "title": "How Social Platforms Measure Video Views [Infographic]",
    "link": "https://www.socialmediatoday.com/news/how-social-platforms-measure-video-view-counts-infographic/751437/?.tsrc=rss",
    "content": "A handy listing to ensure that you're tracking the right data points.",
    "pubDate": "Mon, 23 Jun 2025 19:53:47 +0000"
  },
  {
    "title": "US stocks aren’t safe in heated global tensions anymore",
    "link": "https://www.thestreet.com/crypto/markets/us-stocks-arent-safe-in-heated-global-tensions-anymore?.tsrc=rss",
    "content": "Bitcoin's volatility drops below major U.S. stocks as long-term holders drive asset class maturity.",
    "pubDate": "Mon, 23 Jun 2025 19:45:00 +0000"
  },
  {
    "title": "Cantor Fitzgerald Boosts Meta (META) PT to $807 on Confidence in WhatsApp Ad Monetization",
    "link": "https://finance.yahoo.com/news/cantor-fitzgerald-boosts-meta-meta-193738097.html?.tsrc=rss",
    "content": "Meta Platforms Inc. (NASDAQ:META) is one of the best QQQ stocks to buy according to hedge funds. On June 19, Cantor Fitzgerald reaffirmed its Overweight rating for Meta while increasing the price target from $676 to $807. The adjustment was made by analyst Deepak Mathivanan, who signals strong confidence in Meta’s future growth potential. Meta […]",
    "pubDate": "Mon, 23 Jun 2025 19:37:38 +0000"
  },
  {
    "title": "Meta’s Mark Zuckerberg Says the Technology They’re Developing Will ‘See What You See and Hear What You Hear’",
    "link": "https://www.barchart.com/story/news/33008025/metas-mark-zuckerberg-says-the-technology-theyre-developing-will-see-what-you-see-and-hear-what-you-hear?.tsrc=rss",
    "content": "Mark Zuckerberg’s vision for Meta’s AI strategy centers on deeply personalized, conversational assistants — an approach shaped by his history of consumer-focused innovation and the company’s vast social data ecosystem.",
    "pubDate": "Mon, 23 Jun 2025 18:21:39 +0000"
  },
  {
    "title": "I Predict This \"Magnificent Seven\" Stock Will Crush Expectations",
    "link": "https://www.fool.com/investing/2025/06/23/i-predict-this-magnificent-seven-stock-will-crush/?.tsrc=rss",
    "content": "Nvidia could sizzle as the other six stocks slump.",
    "pubDate": "Mon, 23 Jun 2025 16:33:00 +0000"
  },
  {
    "title": "Market Chatter: US House Bans Meta's WhatsApp From Government Devices on Security Concerns",
    "link": "https://finance.yahoo.com/news/market-chatter-us-house-bans-160456394.html?.tsrc=rss",
    "content": "The chief administrative officer of the US House has informed congressional staffers that Meta's (ME",
    "pubDate": "Mon, 23 Jun 2025 16:04:56 +0000"
  },
  {
    "title": "HII Celebrates First Meal Aboard Virginia-Class Submarine Massachusetts (SSN 798)",
    "link": "https://finance.yahoo.com/news/hii-celebrates-first-meal-aboard-140000856.html?.tsrc=rss",
    "content": "NEWPORT NEWS, Va., June 23, 2025 (GLOBE NEWSWIRE) -- HII’s (NYSE: HII) Newport News Shipbuilding division moved another step closer toward delivery of Virginia-class submarine Massachusetts (SSN 798) when the first meal was recently served aboard the submarine. Massachusetts is currently pierside at NNS and is in the final stages of construction and testing. To celebrate the first meal, the crew welcomed the ship’s sponsor, Sheryl Sandberg, founder, Lean In, and former chief operating officer of",
    "pubDate": "Mon, 23 Jun 2025 14:00:00 +0000"
  },
  {
    "title": "Why Meta Platforms (META) is a Top Growth Stock for the Long-Term",
    "link": "https://finance.yahoo.com/news/why-meta-platforms-meta-top-134510317.html?.tsrc=rss",
    "content": "Wondering how to pick strong, market-beating stocks for your investment portfolio? Look no further than the Zacks Style Scores.",
    "pubDate": "Mon, 23 Jun 2025 13:45:10 +0000"
  },
  {
    "title": "AI Stocks Face 'Show Me' Moment: Agent Battle For Consumers Heats Up",
    "link": "https://finance.yahoo.com/m/684c930d-1475-3adc-b013-ae604c056ebc/ai-stocks-face-%27show-me%27.html?.tsrc=rss",
    "content": "Amid hype over artificial intelligence, the best AI stocks generate revenue or get a strategic edge from the fast evolving technology.",
    "pubDate": "Mon, 23 Jun 2025 13:24:06 +0000"
  },
  {
    "title": "Deepgram CEO Scott Stephenson Launches \"The Scott Stephenson AI Show\" — A No-Hype, Deep-Dive Podcast on the AI Revolution",
    "link": "https://finance.yahoo.com/news/deepgram-ceo-scott-stephenson-launches-123000979.html?.tsrc=rss",
    "content": "SAN FRANCISCO, June 23, 2025--Deepgram is announcing the launch of The Scott Stephenson AI Show, a new podcast hosted by Scott Stephenson, CEO and Co-Founder of Deepgram.",
    "pubDate": "Mon, 23 Jun 2025 12:30:00 +0000"
  },
  {
    "title": "Move over, Magnificent 7: Goldman Sachs proposes the ‘Prom 10,’ China’s top stocks including Tencent, Alibaba and BYD",
    "link": "https://finance.yahoo.com/news/move-over-magnificent-7-goldman-094217732.html?.tsrc=rss",
    "content": "Goldman Sachs recently highlighted 10 different Chinese stocks that it thinks are best poised for growth. Together, they make up the “Prominent 10.\"",
    "pubDate": "Mon, 23 Jun 2025 09:42:17 +0000"
  },
  {
    "title": "The Zacks Analyst Blog Highlights Meta, Palantir, Abbott Laboratories, SandRidge and CompX",
    "link": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-meta-093700408.html?.tsrc=rss",
    "content": "META, PLTR and ABT lead this week's Zacks blog as AI growth, strong pipelines and solid earnings drive investor interest.",
    "pubDate": "Mon, 23 Jun 2025 09:37:00 +0000"
  },
  {
    "title": "Update: Market Chatter: Apple, Meta Won't Face Immediate EU Fines as DMA Grace Period Nears End",
    "link": "https://finance.yahoo.com/news/market-chatter-apple-meta-won-092117638.html?.tsrc=rss",
    "content": "(Updates to add Meta Platforms' comment in the fifth paragraph) Apple (AAPL) and Meta Platforms (",
    "pubDate": "Mon, 23 Jun 2025 09:21:17 +0000"
  },
  {
    "title": "How to avoid finance scams on social media",
    "link": "https://uk.finance.yahoo.com/news/how-to-avoid-finance-scams-social-media-050001105.html?.tsrc=rss",
    "content": "A significant proportion of 'finfluencers' are actually criminals using you to make money — so here's what to look out for.",
    "pubDate": "Mon, 23 Jun 2025 05:00:01 +0000"
  },
  {
    "title": "Zuckerberg Leads AI Recruitment Blitz Armed With $100 Million Pay Packages",
    "link": "https://finance.yahoo.com/m/3e4fb515-4a52-3b37-845b-5501f8c67fff/zuckerberg-leads-ai.html?.tsrc=rss",
    "content": "In a bid to address an AI crisis at his company, the Meta CEO has gotten personally involved in recruiting top talent.",
    "pubDate": "Mon, 23 Jun 2025 01:00:00 +0000"
  },
  {
    "title": "The Best Stocks to Invest $50,000 in Right Now",
    "link": "https://www.fool.com/investing/2025/06/22/the-best-stocks-to-invest-50000-in-right-now/?.tsrc=rss",
    "content": "Meta has a wide moat in social media and digital advertising and a track record of steady growth.  Axon has built a unique business in law enforcement technology.  Meta Platforms (NASDAQ: META) may be the best example of a business that can burn through billions in cash on a side project, but is still overwhelmingly successful.",
    "pubDate": "Sun, 22 Jun 2025 22:15:00 +0000"
  },
  {
    "title": "3 Phenomenal AI Stocks That Investors Should Load Up On",
    "link": "https://www.fool.com/investing/2025/06/24/3-phenomenal-ai-stocks-that-investors-should-load/?.tsrc=rss",
    "content": "Nvidia's GPUs have built most of the AI technology we experience today.  Broadcom's connectivity switches and XPUs are slated to grow as inference becomes more common.  Artificial intelligence (AI) investing doesn't have to be hard.",
    "pubDate": "Tue, 24 Jun 2025 09:30:00 +0000"
  },
  {
    "title": "Nvidia Stock Rises. Why This Isn’t a Time to Relax.",
    "link": "https://finance.yahoo.com/m/bf2ab9dc-9ba6-381f-bdc1-cc3c664162be/nvidia-stock-rises.-why-this.html?.tsrc=rss",
    "content": "Nvidia  stock rose alongside a market that was breathing a sigh of relief early Tuesday as the Israel-Iran conflict appeared to have an end in sight.  Shares of the chip maker were up 1.1% to $145.76 in premarket trading Tuesday.  It comes after geopolitical risks spiked over the weekend as the U.S. attacked Iran’s nuclear facilities following a week of Israel and Iran exchanging strikes.",
    "pubDate": "Tue, 24 Jun 2025 08:56:00 +0000"
  },
  {
    "title": "This Is Nvidia's Next Trillion-Dollar Opportunity, According to Jensen Huang -- and It's Something You Might be Overlooking",
    "link": "https://www.fool.com/investing/2025/06/24/this-nvidia-trillion-dollar-opportunity-jensen-hua/?.tsrc=rss",
    "content": "The majority of Nvidia's revenue comes from its data center business, thanks to booming sales of its industry-leading artificial intelligence (AI) chips.  Nvidia CEO Jensen Huang thinks autonomous vehicles could be the next trillion-dollar opportunity for the company.  According to a forecast from Huang earlier this year, Nvidia's automotive revenue could triple during fiscal 2026.",
    "pubDate": "Tue, 24 Jun 2025 08:49:00 +0000"
  },
  {
    "title": "Stock-Split Watch: Is This AI Stock That's Soared 300% Next on the List?",
    "link": "https://www.fool.com/investing/2025/06/24/stock-split-watch-is-this-ai-stock-thats-soared-30/?.tsrc=rss",
    "content": "Only one \"Magnificent Seven\" company hasn’t yet split its stock.  Stock splits make it easier for a broader range of investors to buy the shares.  Stock splits have fascinated investors over the past few years, with even the biggest artificial intelligence (AI) names -- such as Nvidia and Amazon -- completing such operations after their stock prices skyrocketed.",
    "pubDate": "Tue, 24 Jun 2025 08:10:00 +0000"
  },
  {
    "title": "Prediction: Palantir Stock Will Plunge to $55 by 2027",
    "link": "https://www.fool.com/investing/2025/06/24/prediction-palantir-stock-plunge-to-55-by-2027/?.tsrc=rss",
    "content": "Wall Street's hottest artificial intelligence (AI) stock, which has gained more than 2,000% since the start of 2023, may be about to reverse course.",
    "pubDate": "Tue, 24 Jun 2025 07:51:00 +0000"
  },
  {
    "title": "Billionaire David Tepper Sold 97% of Appaloosa's Nvidia Stake and His Entire Position in AMD in Favor of This Trillion-Dollar Artificial Intelligence (AI) Stock",
    "link": "https://www.fool.com/investing/2025/06/24/billionaire-david-tepper-sold-nvidia-amd-ai-stock/?.tsrc=rss",
    "content": "Appaloosa's billionaire chief appears to be shifting his focus within the artificial intelligence (AI) arena.",
    "pubDate": "Tue, 24 Jun 2025 07:06:00 +0000"
  },
  {
    "title": "China on Cusp of Seeing Over 100 DeepSeeks, Ex-Top Official Says",
    "link": "https://finance.yahoo.com/news/china-cusp-seeing-over-100-053423454.html?.tsrc=rss",
    "content": "(Bloomberg) -- China’s advantages in developing artificial intelligence are about to unleash a wave of innovation that will generate more than 100 DeepSeek-like breakthroughs in the coming 18 months, according to a former top official.Most Read from BloombergBezos Wedding Draws Protests, Soul-Searching Over Tourism in VeniceUS State Budget Wounds Intensify From Trump, DOGE Policy ShiftsCommuters Risk Lives in Johannesburg With Taxi Groups at WarThe new software products “will fundamentally chang",
    "pubDate": "Tue, 24 Jun 2025 05:34:23 +0000"
  },
  {
    "title": "Jensen Huang Starts Selling Nvidia Stock Under $865 Million Plan",
    "link": "https://finance.yahoo.com/news/jensen-huang-starts-selling-nvidia-012230080.html?.tsrc=rss",
    "content": "(Bloomberg) -- Nvidia Corp. Chief Executive Officer Jensen Huang has started selling the chipmaker’s stock, his first transactions under a plan that allows him to offload up to $865 million worth by year’s end.Most Read from BloombergBezos Wedding Draws Protests, Soul-Searching Over Tourism in VeniceUS State Budget Wounds Intensify From Trump, DOGE Policy ShiftsTaxi Wars Put Johannesburg Commuters in Peril as Rail FloundersHuang disposed of 100,000 shares over a two-day period of June 20 and Jun",
    "pubDate": "Tue, 24 Jun 2025 01:22:30 +0000"
  },
  {
    "title": "The Best Stocks to Invest $1,000 in Right Now",
    "link": "https://www.fool.com/investing/2025/06/23/the-best-stocks-to-invest-1000-in-right-now/?.tsrc=rss",
    "content": "Nvidia has grown its revenue for nine consecutive quarters and currently has a 92% share of the GPU market.  AppLovin's AI tools and performance-based business model are impressing advertisers.  Few AI companies have been as successful as Nvidia (NASDAQ: NVDA), which develops the graphics processing units (GPUs) that provide the specific type of processing power that advanced AI applications need most.",
    "pubDate": "Tue, 24 Jun 2025 00:15:00 +0000"
  },
  {
    "title": "Better Artificial Intelligence Stock: BigBear.ai vs. C3.ai",
    "link": "https://www.fool.com/investing/2025/06/23/better-artificial-intelligence-stock-bigbearai-vs/?.tsrc=rss",
    "content": "Nations are ramping up artificial intelligence capabilities, and the U.S. is determined to lead the world in AI.  BigBear.ai and C3.ai are helping the U.S. government with its AI goals.  Nations are rushing to embrace artificial intelligence (AI), and for good reason.",
    "pubDate": "Tue, 24 Jun 2025 00:00:00 +0000"
  },
  {
    "title": "3 Things to Watch Ahead of the Nvidia Annual Meeting on June 25",
    "link": "https://www.barchart.com/story/news/33009828/3-things-to-watch-ahead-of-the-nvidia-annual-meeting-on-june-25?.tsrc=rss",
    "content": "Nvidia shares are in focus ahead of the AI darling’s annual shareholder meeting on June 25. Redburn Atlantic continues to see further upside in NVDA stock to $178.",
    "pubDate": "Mon, 23 Jun 2025 20:31:41 +0000"
  },
  {
    "title": "AMD Stock Gets New Buy Rating As AI Efforts Take Hold",
    "link": "https://finance.yahoo.com/m/2bbdecb4-82d9-3431-87f0-f9b44166d980/amd-stock-gets-new-buy-rating.html?.tsrc=rss",
    "content": "Advanced Micro Devices has turned a Wall Street skeptic into a bull with its progress in artificial intelligence chips and computing systems.",
    "pubDate": "Mon, 23 Jun 2025 20:30:06 +0000"
  },
  {
    "title": "AI Giants Nvidia, Meta And More Fuel This Power-Play Breakout",
    "link": "https://finance.yahoo.com/m/fef929d0-3742-3c54-8d81-19143dffff86/ai-giants-nvidia%2C-meta-and.html?.tsrc=rss",
    "content": "As AI leaders like Nvidia and Meta drive demand for data centers, Vistra provides the needed fuel and powers a breakout.",
    "pubDate": "Mon, 23 Jun 2025 20:00:06 +0000"
  },
  {
    "title": "NVIDIA Forges Strategic AI Partnerships, Reports Strong Q1 2026 Results Despite Export Setbacks",
    "link": "https://finance.yahoo.com/news/nvidia-forges-strategic-ai-partnerships-195300421.html?.tsrc=rss",
    "content": "NVIDIA Corporation (NASDAQ:NVDA) is one of the best QQQ stocks to buy according to hedge funds. On June 19, Simply Wall St reported that NVIDIA entered into a collaboration with Tech Soft 3D and a partnership with Dell Technologies and Trend Micro. These alliances are focused on enhancing interoperability and developing AI-powered cybersecurity solutions. ]In FQ1 […]",
    "pubDate": "Mon, 23 Jun 2025 19:53:00 +0000"
  },
  {
    "title": "US stocks aren’t safe in heated global tensions anymore",
    "link": "https://www.thestreet.com/crypto/markets/us-stocks-arent-safe-in-heated-global-tensions-anymore?.tsrc=rss",
    "content": "Bitcoin's volatility drops below major U.S. stocks as long-term holders drive asset class maturity.",
    "pubDate": "Mon, 23 Jun 2025 19:45:00 +0000"
  },
  {
    "title": "Nebius Announces General Availability of NVIDIA GB200 Superchip Capacity in Europe",
    "link": "https://finance.yahoo.com/news/nebius-announces-general-availability-nvidia-191128920.html?.tsrc=rss",
    "content": "Nebius Group (NASDAQ:NBIS) is one of the best technology stocks according to Wall Street analysts. Earlier on June 11, Nebius announced the general availability of NVIDIA Corporation’s (NASDAQ:NVDA) GB200 Grace Blackwell Superchip capacity for its customers in Europe. This marked a significant step in Nebius’ mission to build a comprehensive AI infrastructure globally, accelerating AI […]",
    "pubDate": "Mon, 23 Jun 2025 19:11:28 +0000"
  },
  {
    "title": "Nvidia Secures Entire Wistron Plant Through 2026 to Build AI Servers",
    "link": "https://finance.yahoo.com/news/nvidia-secures-entire-wistron-plant-185445590.html?.tsrc=rss",
    "content": "The facility started operations in June and is expected to build over 240,000 Blackwell-based systems per quarter",
    "pubDate": "Mon, 23 Jun 2025 18:54:45 +0000"
  },
  {
    "title": "The Next Trillion-Dollar Boom? 3 Stocks to Buy with 300 Million Humanoid Robots on the Horizon.",
    "link": "https://www.barchart.com/story/news/33006352/the-next-trillion-dollar-boom-3-stocks-to-buy-with-300-million-humanoid-robots-on-the-horizon?.tsrc=rss",
    "content": "Here’s why these three mega-cap tech stocks are poised to benefit from the robotics boom over the next three decades.",
    "pubDate": "Mon, 23 Jun 2025 16:50:55 +0000"
  },
  {
    "title": "I Predict This \"Magnificent Seven\" Stock Will Crush Expectations",
    "link": "https://www.fool.com/investing/2025/06/23/i-predict-this-magnificent-seven-stock-will-crush/?.tsrc=rss",
    "content": "Nvidia could sizzle as the other six stocks slump.",
    "pubDate": "Mon, 23 Jun 2025 16:33:00 +0000"
  },
  {
    "title": "Health Care Roundup: Market Talk",
    "link": "https://finance.yahoo.com/m/3b16b67c-9ec5-3991-86d6-60f91b3e0991/health-care-roundup%3A-market.html?.tsrc=rss",
    "content": "Find insight on Novo Nordisk, Bumrungrad Hospital, Riverstone Holdings, and more in the latest Market Talks covering Health Care.",
    "pubDate": "Mon, 23 Jun 2025 16:29:00 +0000"
  },
  {
    "title": "Tampa General Hospital introduces ambient listening capabilities for nurses",
    "link": "https://www.hospitalmanagement.net/news/tampa-general-hospital-nurses/?.tsrc=rss",
    "content": "The tool captures patient symptoms, observations, and experiences, converting them into specialised clinical summaries.",
    "pubDate": "Tue, 24 Jun 2025 10:09:20 +0000"
  },
  {
    "title": "There Are Currently Better Options Than Microsoft",
    "link": "https://finance.yahoo.com/news/currently-better-options-microsoft-093720326.html?.tsrc=rss",
    "content": "The reason other Mag-7 stocks are more attractive at the moment.",
    "pubDate": "Tue, 24 Jun 2025 09:37:20 +0000"
  },
  {
    "title": "2 Top Artificial Intelligence Stocks to Buy Right Now",
    "link": "https://www.fool.com/investing/2025/06/24/2-top-artificial-intelligence-stocks-buy-right-now/?.tsrc=rss",
    "content": "ServiceNow is experiencing strong growth as it integrates AI across its cloud-based workflow automation platform.  Microsoft is seeing incredible momentum in its enterprise cloud service business.  Leading companies across semiconductors, cloud services, and software are seeing surging demand.",
    "pubDate": "Tue, 24 Jun 2025 08:15:00 +0000"
  },
  {
    "title": "Microsoft (MSFT) Surpasses Market Returns: Some Facts Worth Knowing",
    "link": "https://finance.yahoo.com/news/microsoft-msft-surpasses-market-returns-214503253.html?.tsrc=rss",
    "content": "Microsoft (MSFT) closed the most recent trading day at $486.00, moving +1.8% from the previous trading session.",
    "pubDate": "Mon, 23 Jun 2025 21:45:03 +0000"
  },
  {
    "title": "How Microsoft Built a Reliable Dividend Track Record in a Growth-Focused Sector",
    "link": "https://finance.yahoo.com/news/microsoft-built-reliable-dividend-track-212244562.html?.tsrc=rss",
    "content": "Microsoft Corporation (NASDAQ:MSFT) is one of the 10 Technology Dividend Aristocrats to Buy in 2025. Microsoft Corporation (NASDAQ:MSFT) surprised Wall Street in 2003 when it announced its first-ever dividend, especially since the company was dealing with costly antitrust challenges at the time. Analysts viewed the move as a smart step, both financially and strategically. Today, […]",
    "pubDate": "Mon, 23 Jun 2025 21:22:44 +0000"
  },
  {
    "title": "Microsoft and IBM Just Hit Fresh Highs. Both Are Still Set for AI-Driven Gains, Analysts Say",
    "link": "https://www.investopedia.com/microsoft-and-ibm-just-hit-fresh-highs-both-are-still-set-for-ai-driven-gains-analysts-say-11759642?.tsrc=rss",
    "content": "Microsoft and International Business Machines shares closed at record highs Monday, building on a string of recent gains.",
    "pubDate": "Mon, 23 Jun 2025 20:58:23 +0000"
  },
  {
    "title": "US stocks aren’t safe in heated global tensions anymore",
    "link": "https://www.thestreet.com/crypto/markets/us-stocks-arent-safe-in-heated-global-tensions-anymore?.tsrc=rss",
    "content": "Bitcoin's volatility drops below major U.S. stocks as long-term holders drive asset class maturity.",
    "pubDate": "Mon, 23 Jun 2025 19:45:00 +0000"
  },
  {
    "title": "Microsoft, AMD Partner to Co-Engineer Custom Silicon for Next-Gen Xbox Consoles",
    "link": "https://finance.yahoo.com/news/microsoft-amd-partner-co-engineer-193736770.html?.tsrc=rss",
    "content": "Microsoft Corporation (NASDAQ:MSFT) is one of the best QQQ stocks to buy according to hedge funds. On June 18, Microsoft and Advanced Micro Devices Inc. (NASDAQ:AMD) announced a multi-year agreement to co-engineer custom silicon for a range of devices, such as Microsoft’s next-generation Xbox consoles. The partnership aims to enhance visual quality, immersive gameplay, and […]",
    "pubDate": "Mon, 23 Jun 2025 19:37:36 +0000"
  },
  {
    "title": "Microsoft to Cut Thousands of Jobs as AI Spending Surges",
    "link": "https://finance.yahoo.com/news/microsoft-cut-thousands-jobs-ai-185308228.html?.tsrc=rss",
    "content": "Cuts follow a prior 6,000-person reduction in May; new round expected after fiscal year ends",
    "pubDate": "Mon, 23 Jun 2025 18:53:08 +0000"
  },
  {
    "title": "Leak reveals Grok might soon edit your spreadsheets",
    "link": "https://finance.yahoo.com/news/leak-reveals-grok-might-soon-181657484.html?.tsrc=rss",
    "content": "Leaked code suggests xAI is developing an advanced file editor for Grok with spreadsheet support, signaling the company’s push to compete with OpenAI, Google, and Microsoft by embedding AI copilots into productivity tools.",
    "pubDate": "Mon, 23 Jun 2025 18:16:57 +0000"
  },
  {
    "title": "I Predict This \"Magnificent Seven\" Stock Will Crush Expectations",
    "link": "https://www.fool.com/investing/2025/06/23/i-predict-this-magnificent-seven-stock-will-crush/?.tsrc=rss",
    "content": "Nvidia could sizzle as the other six stocks slump.",
    "pubDate": "Mon, 23 Jun 2025 16:33:00 +0000"
  },
  {
    "title": "Can Amazon Continue to Dominate the Fast Cloud Security Market Growth?",
    "link": "https://finance.yahoo.com/news/amazon-continue-dominate-fast-cloud-153400300.html?.tsrc=rss",
    "content": "AMZN strengthens AWS security tools and ecosystem to defend its lead in the fast-growing cloud security market.",
    "pubDate": "Mon, 23 Jun 2025 15:34:00 +0000"
  },
  {
    "title": "Will IBM's Growing AI Prowess Deliver Sustainable Growth?",
    "link": "https://finance.yahoo.com/news/ibms-growing-ai-prowess-deliver-152900372.html?.tsrc=rss",
    "content": "IBM deepens AI push with new security and governance tools, strategic alliances and expanding industry applications.",
    "pubDate": "Mon, 23 Jun 2025 15:29:00 +0000"
  },
  {
    "title": "Will Nebius Achieve its $1B ARR and Up to $700M Revenue Targets?",
    "link": "https://finance.yahoo.com/news/nebius-achieve-1b-arr-700m-134500093.html?.tsrc=rss",
    "content": "NBIS posts 385% Q1 revenue growth, eyes up to $1B ARR for 2025 as AI demand surges and global expansion accelerates.",
    "pubDate": "Mon, 23 Jun 2025 13:45:00 +0000"
  },
  {
    "title": "Wall Street Bulls Look Optimistic About Microsoft (MSFT): Should You Buy?",
    "link": "https://finance.yahoo.com/news/wall-street-bulls-look-optimistic-133002074.html?.tsrc=rss",
    "content": "According to the average brokerage recommendation (ABR), one should invest in Microsoft (MSFT). It is debatable whether this highly sought-after metric is effective because Wall Street analysts' recommendations tend to be overly optimistic. Would it be worth investing in the stock?",
    "pubDate": "Mon, 23 Jun 2025 13:30:02 +0000"
  },
  {
    "title": "AI Stocks Face 'Show Me' Moment: Agent Battle For Consumers Heats Up",
    "link": "https://finance.yahoo.com/m/684c930d-1475-3adc-b013-ae604c056ebc/ai-stocks-face-%27show-me%27.html?.tsrc=rss",
    "content": "Amid hype over artificial intelligence, the best AI stocks generate revenue or get a strategic edge from the fast evolving technology.",
    "pubDate": "Mon, 23 Jun 2025 13:24:06 +0000"
  },
  {
    "title": "C3.ai Ramps Up Partner-Led Sales Model: Can It Drive Scalable Growth?",
    "link": "https://finance.yahoo.com/news/c3-ai-ramps-partner-led-131300848.html?.tsrc=rss",
    "content": "AI's accelerating partner-led strategy with tech giants like Microsoft is driving sharp deal growth in fiscal 2025.",
    "pubDate": "Mon, 23 Jun 2025 13:13:00 +0000"
  },
  {
    "title": "Here is What to Know Beyond Why Microsoft Corporation (MSFT) is a Trending Stock",
    "link": "https://finance.yahoo.com/news/know-beyond-why-microsoft-corporation-130003128.html?.tsrc=rss",
    "content": "Recently, Zacks.com users have been paying close attention to Microsoft (MSFT). This makes it worthwhile to examine what the stock has in store.",
    "pubDate": "Mon, 23 Jun 2025 13:00:03 +0000"
  },
  {
    "title": "Solace Ranked Exemplary Provider by ISG Software Research in 2025 Messaging and Event Processing Buyers Guide",
    "link": "https://finance.yahoo.com/news/solace-ranked-exemplary-provider-isg-130000857.html?.tsrc=rss",
    "content": "Solace, the leader in powering real-time, event-driven integration for the agentic age, today announced it was named an \"Exemplary Provider\" in ISG Software Research's 2025 Messaging and Event Processing Buyers Guide, joining other industry heavyweights such as AWS, IBM, Microsoft and Google Cloud. An \"Exemplary\" rating is the highest classification given to those vendors who performed beyond the median in overall product and customer experience scoring.",
    "pubDate": "Mon, 23 Jun 2025 13:00:00 +0000"
  },
  {
    "title": "Rezolve Ai to Join Russell 2000® and Russell 3000® Indices Following Breakout Year of Hypergrowth and Strategic Alliances",
    "link": "https://finance.yahoo.com/news/rezolve-ai-join-russell-2000-120000532.html?.tsrc=rss",
    "content": "$70 Million ARR Locked in via Customer ContractsMicrosoft and Google Partnerships Accelerate Momentum NEW YORK, June 23, 2025 (GLOBE NEWSWIRE) -- Rezolve Ai (NASDAQ: RZLV), the company reinventing retail through real-time AI-driven consumer engagement, today announced its inclusion in the prestigious Russell 2000® and Russell 3000® Indices, effective after market close on June 27, 2025, following the annual reconstitution by FTSE Russell. The milestone reinforces a strong year for Rezolve Ai, wh",
    "pubDate": "Mon, 23 Jun 2025 12:00:00 +0000"
  },
  {
    "title": "Stock-Split Watch: Is This AI Stock That's Soared 300% Next on the List?",
    "link": "https://www.fool.com/investing/2025/06/24/stock-split-watch-is-this-ai-stock-thats-soared-30/?.tsrc=rss",
    "content": "Only one \"Magnificent Seven\" company hasn’t yet split its stock.  Stock splits make it easier for a broader range of investors to buy the shares.  Stock splits have fascinated investors over the past few years, with even the biggest artificial intelligence (AI) names -- such as Nvidia and Amazon -- completing such operations after their stock prices skyrocketed.",
    "pubDate": "Tue, 24 Jun 2025 08:10:00 +0000"
  },
  {
    "title": "Boost for Starmer as Amazon vows to invest £40bn",
    "link": "https://uk.finance.yahoo.com/news/boost-starmer-amazon-vows-invest-080000380.html?.tsrc=rss",
    "content": "Amazon has pledged to invest £40bn in Britain over the next three years in a vote of confidence in Labour’s Britain.",
    "pubDate": "Tue, 24 Jun 2025 08:00:00 +0000"
  },
  {
    "title": "Amazon to invest £40 billion in U.K. over next three years",
    "link": "https://finance.yahoo.com/news/amazon-invest-40-billion-u-065207542.html?.tsrc=rss",
    "content": "Investing.com -- Amazon.com Inc (NASDAQ:AMZN) plans to invest about £40 billion in the United Kingdom (TADAWUL:4280) over the next three years to boost innovation and support the country’s artificial-intelligence drive, according to the company on Tuesday.",
    "pubDate": "Tue, 24 Jun 2025 06:52:07 +0000"
  },
  {
    "title": "Amazon to Invest Around $54 Billion in U.K. to Support Innovation, AI Push",
    "link": "https://finance.yahoo.com/m/bfe50230-ddb5-3167-8e03-ae9132351ee3/amazon-to-invest-around-%2454.html?.tsrc=rss",
    "content": "The plan also includes the creation of four new fulfillment centers and new delivery stations nationwide.",
    "pubDate": "Tue, 24 Jun 2025 06:04:00 +0000"
  },
  {
    "title": "2 Internet Stocks on Our Watchlist and 1 to Turn Down",
    "link": "https://finance.yahoo.com/news/2-internet-stocks-watchlist-1-043337043.html?.tsrc=rss",
    "content": "By breaking down physical barriers, consumer internet businesses are reshaping how people shop, connect, learn, and play. Luckily for them, the market seems to believe there is a long runway for growth as the industry has recorded a 3.7% gain over the past six months while the S&P 500 was stuck in neutral.",
    "pubDate": "Tue, 24 Jun 2025 04:33:37 +0000"
  },
  {
    "title": "Amazon to invest $54 billion in Britain over next three years",
    "link": "https://uk.finance.yahoo.com/news/amazon-invest-54-billion-britain-230918673.html?.tsrc=rss",
    "content": "LONDON (Reuters) -Amazon has deepened its commitment to Britain, with the e-commerce giant saying it plans to invest 40 billion pounds ($54 billion) over the next three years, a move the UK government hailed as a vote of confidence in its economic policies.  Elected in 2024, the Labour government has made boosting Britain's anaemic growth a priority and wants to see a step up in foreign investment.  Amazon said on Tuesday its expansion in Britain, its third biggest market after the United States and Germany, would create thousands of jobs.",
    "pubDate": "Mon, 23 Jun 2025 23:09:18 +0000"
  },
  {
    "title": "Amazon’s new UK warehouses to hire thousands as Starmer hails ‘win’ for Britain",
    "link": "https://uk.finance.yahoo.com/news/amazon-uk-warehouses-hire-thousands-230100287.html?.tsrc=rss",
    "content": "Prime Minister Sir Keir Starmer hailed the expansion plans as a ‘major win’ and a vote of confidence in the UK.",
    "pubDate": "Mon, 23 Jun 2025 23:01:00 +0000"
  },
  {
    "title": "Experian Chooses Amazon (AMZN) AWS to Power Its Cloud and AI Transformation",
    "link": "https://finance.yahoo.com/news/experian-chooses-amazon-amzn-aws-223509311.html?.tsrc=rss",
    "content": "Amazon.com, Inc. (NASDAQ:AMZN) is one of the 10 AI Stocks in the Spotlight. On June 19, the company announced that Experian, a global data and technology company, has selected AWS as its preferred cloud. Experian will be leveraging AWS’s advanced cloud capabilities to offer faster and scalable solutions to deliver deeper insights and more secure data services […]",
    "pubDate": "Mon, 23 Jun 2025 22:35:09 +0000"
  },
  {
    "title": "Tesla Shares Jump Most in Two Months on Robotaxi Rollout",
    "link": "https://finance.yahoo.com/news/tesla-starts-long-awaited-robotaxi-003252048.html?.tsrc=rss",
    "content": "(Bloomberg) -- Tesla Inc. shares climbed after the automaker rolled out its long-promised driverless taxi service to a handful of riders, a modest debut for what Elon Musk sees as a transformative new business line.Most Read from BloombergBezos Wedding Draws Protests, Soul-Searching Over Tourism in VeniceUS State Budget Wounds Intensify From Trump, DOGE Policy ShiftsThe first robotaxi trips were limited to a narrow portion of Tesla’s hometown of Austin on Sunday, with an employee sitting in the",
    "pubDate": "Mon, 23 Jun 2025 21:20:00 +0000"
  },
  {
    "title": "Top Stock Reports for Amazon.com, Home Depot & Cisco Systems",
    "link": "https://finance.yahoo.com/news/top-stock-reports-amazon-com-205600251.html?.tsrc=rss",
    "content": "AMZN gains 12.7% as AWS growth, Prime momentum, and GenAI focus offset mixed Q2 outlook and tariff risks.",
    "pubDate": "Mon, 23 Jun 2025 20:56:00 +0000"
  },
  {
    "title": "Nuclear Power’s Biggest IPO in Years Is on the Way",
    "link": "https://finance.yahoo.com/m/57144676-fd88-3576-9758-6635055b1367/nuclear-power%E2%80%99s-biggest-ipo.html?.tsrc=rss",
    "content": "Holtec CEO says the plan is to go public within several months. The IPO may be coming at just the right time.",
    "pubDate": "Mon, 23 Jun 2025 20:22:00 +0000"
  },
  {
    "title": "US stocks aren’t safe in heated global tensions anymore",
    "link": "https://www.thestreet.com/crypto/markets/us-stocks-arent-safe-in-heated-global-tensions-anymore?.tsrc=rss",
    "content": "Bitcoin's volatility drops below major U.S. stocks as long-term holders drive asset class maturity.",
    "pubDate": "Mon, 23 Jun 2025 19:45:00 +0000"
  },
  {
    "title": "Amazon to Invest $233 Million in India Operations for 2025 for Infrastructure, E-commerce Growth",
    "link": "https://finance.yahoo.com/news/amazon-invest-233-million-india-193734374.html?.tsrc=rss",
    "content": "Amazon.com Inc. (NASDAQ:AMZN) is one of the best QQQ stocks to buy according to hedge funds. On June 19, Amazon announced that the company will invest $233 million in its India operations in 2025. The move underscores Amazon’s commitment to capturing a larger share of India’s rapidly expanding e-commerce market. The investment will enhance infrastructure, […]",
    "pubDate": "Mon, 23 Jun 2025 19:37:34 +0000"
  },
  {
    "title": "Microsoft to Cut Thousands of Jobs as AI Spending Surges",
    "link": "https://finance.yahoo.com/news/microsoft-cut-thousands-jobs-ai-185308228.html?.tsrc=rss",
    "content": "Cuts follow a prior 6,000-person reduction in May; new round expected after fiscal year ends",
    "pubDate": "Mon, 23 Jun 2025 18:53:08 +0000"
  },
  {
    "title": "Jeff Bezos famously neglected to sign a prenup in his first marriage. He’s not making the same mistake twice",
    "link": "https://finance.yahoo.com/news/jeff-bezos-famously-neglected-sign-184734141.html?.tsrc=rss",
    "content": "The Amazon founder, who is worth nearly $224 billion, is set to wed fiancée Lauren Sanchez this week.",
    "pubDate": "Mon, 23 Jun 2025 18:47:34 +0000"
  },
  {
    "title": "Over a million people now have access to the gen-AI powered Alexa+",
    "link": "https://finance.yahoo.com/news/over-million-people-now-access-173840255.html?.tsrc=rss",
    "content": "Alexa+ is available for free during Early Access and will later be free for Prime customers. Non-Prime users will be able to use the service for $19.99 per month after it publicly launches.",
    "pubDate": "Mon, 23 Jun 2025 17:38:40 +0000"
  },
  {
    "title": "Amazon Will Be Largest U.S. Retailer This Year, Beating Walmart, Says J.P. Morgan",
    "link": "https://finance.yahoo.com/m/368a1c97-725a-3b9e-802e-dac48cb4fd1c/amazon-will-be-largest-u.s..html?.tsrc=rss",
    "content": "Internet analyst Doug Anmuth reiterated an Overweight rating and $240 price target for the e-commerce stock.",
    "pubDate": "Mon, 23 Jun 2025 16:25:00 +0000"
  },
  {
    "title": "Analyst's Bold Amazon Call Has Traders Talking",
    "link": "https://finance.yahoo.com/news/analysts-bold-amazon-call-traders-155059165.html?.tsrc=rss",
    "content": "This analyst call has Amazon stock investors on alert",
    "pubDate": "Mon, 23 Jun 2025 15:50:59 +0000"
  },
  {
    "title": "Can Amazon Continue to Dominate the Fast Cloud Security Market Growth?",
    "link": "https://finance.yahoo.com/news/amazon-continue-dominate-fast-cloud-153400300.html?.tsrc=rss",
    "content": "AMZN strengthens AWS security tools and ecosystem to defend its lead in the fast-growing cloud security market.",
    "pubDate": "Mon, 23 Jun 2025 15:34:00 +0000"
  },
  {
    "title": "Are You a Momentum Investor? This 1 Stock Could Be the Perfect Pick",
    "link": "https://finance.yahoo.com/news/momentum-investor-1-stock-could-135009997.html?.tsrc=rss",
    "content": "Wondering how to pick strong, market-beating stocks for your investment portfolio? Look no further than the Zacks Style Scores.",
    "pubDate": "Mon, 23 Jun 2025 13:50:09 +0000"
  },
  {
    "title": "Stock-Split Watch: Is This AI Stock That's Soared 300% Next on the List?",
    "link": "https://www.fool.com/investing/2025/06/24/stock-split-watch-is-this-ai-stock-thats-soared-30/?.tsrc=rss",
    "content": "Only one \"Magnificent Seven\" company hasn’t yet split its stock.  Stock splits make it easier for a broader range of investors to buy the shares.  Stock splits have fascinated investors over the past few years, with even the biggest artificial intelligence (AI) names -- such as Nvidia and Amazon -- completing such operations after their stock prices skyrocketed.",
    "pubDate": "Tue, 24 Jun 2025 08:10:00 +0000"
  },
  {
    "title": "Boost for Starmer as Amazon vows to invest £40bn",
    "link": "https://uk.finance.yahoo.com/news/boost-starmer-amazon-vows-invest-080000380.html?.tsrc=rss",
    "content": "Amazon has pledged to invest £40bn in Britain over the next three years in a vote of confidence in Labour’s Britain.",
    "pubDate": "Tue, 24 Jun 2025 08:00:00 +0000"
  },
  {
    "title": "Amazon to invest £40 billion in U.K. over next three years",
    "link": "https://finance.yahoo.com/news/amazon-invest-40-billion-u-065207542.html?.tsrc=rss",
    "content": "Investing.com -- Amazon.com Inc (NASDAQ:AMZN) plans to invest about £40 billion in the United Kingdom (TADAWUL:4280) over the next three years to boost innovation and support the country’s artificial-intelligence drive, according to the company on Tuesday.",
    "pubDate": "Tue, 24 Jun 2025 06:52:07 +0000"
  },
  {
    "title": "Amazon to Invest Around $54 Billion in U.K. to Support Innovation, AI Push",
    "link": "https://finance.yahoo.com/m/bfe50230-ddb5-3167-8e03-ae9132351ee3/amazon-to-invest-around-%2454.html?.tsrc=rss",
    "content": "The plan also includes the creation of four new fulfillment centers and new delivery stations nationwide.",
    "pubDate": "Tue, 24 Jun 2025 06:04:00 +0000"
  },
  {
    "title": "2 Internet Stocks on Our Watchlist and 1 to Turn Down",
    "link": "https://finance.yahoo.com/news/2-internet-stocks-watchlist-1-043337043.html?.tsrc=rss",
    "content": "By breaking down physical barriers, consumer internet businesses are reshaping how people shop, connect, learn, and play. Luckily for them, the market seems to believe there is a long runway for growth as the industry has recorded a 3.7% gain over the past six months while the S&P 500 was stuck in neutral.",
    "pubDate": "Tue, 24 Jun 2025 04:33:37 +0000"
  },
  {
    "title": "Amazon to invest $54 billion in Britain over next three years",
    "link": "https://uk.finance.yahoo.com/news/amazon-invest-54-billion-britain-230918673.html?.tsrc=rss",
    "content": "LONDON (Reuters) -Amazon has deepened its commitment to Britain, with the e-commerce giant saying it plans to invest 40 billion pounds ($54 billion) over the next three years, a move the UK government hailed as a vote of confidence in its economic policies.  Elected in 2024, the Labour government has made boosting Britain's anaemic growth a priority and wants to see a step up in foreign investment.  Amazon said on Tuesday its expansion in Britain, its third biggest market after the United States and Germany, would create thousands of jobs.",
    "pubDate": "Mon, 23 Jun 2025 23:09:18 +0000"
  },
  {
    "title": "Amazon’s new UK warehouses to hire thousands as Starmer hails ‘win’ for Britain",
    "link": "https://uk.finance.yahoo.com/news/amazon-uk-warehouses-hire-thousands-230100287.html?.tsrc=rss",
    "content": "Prime Minister Sir Keir Starmer hailed the expansion plans as a ‘major win’ and a vote of confidence in the UK.",
    "pubDate": "Mon, 23 Jun 2025 23:01:00 +0000"
  },
  {
    "title": "Experian Chooses Amazon (AMZN) AWS to Power Its Cloud and AI Transformation",
    "link": "https://finance.yahoo.com/news/experian-chooses-amazon-amzn-aws-223509311.html?.tsrc=rss",
    "content": "Amazon.com, Inc. (NASDAQ:AMZN) is one of the 10 AI Stocks in the Spotlight. On June 19, the company announced that Experian, a global data and technology company, has selected AWS as its preferred cloud. Experian will be leveraging AWS’s advanced cloud capabilities to offer faster and scalable solutions to deliver deeper insights and more secure data services […]",
    "pubDate": "Mon, 23 Jun 2025 22:35:09 +0000"
  },
  {
    "title": "Tesla Shares Jump Most in Two Months on Robotaxi Rollout",
    "link": "https://finance.yahoo.com/news/tesla-starts-long-awaited-robotaxi-003252048.html?.tsrc=rss",
    "content": "(Bloomberg) -- Tesla Inc. shares climbed after the automaker rolled out its long-promised driverless taxi service to a handful of riders, a modest debut for what Elon Musk sees as a transformative new business line.Most Read from BloombergBezos Wedding Draws Protests, Soul-Searching Over Tourism in VeniceUS State Budget Wounds Intensify From Trump, DOGE Policy ShiftsThe first robotaxi trips were limited to a narrow portion of Tesla’s hometown of Austin on Sunday, with an employee sitting in the",
    "pubDate": "Mon, 23 Jun 2025 21:20:00 +0000"
  },
  {
    "title": "Top Stock Reports for Amazon.com, Home Depot & Cisco Systems",
    "link": "https://finance.yahoo.com/news/top-stock-reports-amazon-com-205600251.html?.tsrc=rss",
    "content": "AMZN gains 12.7% as AWS growth, Prime momentum, and GenAI focus offset mixed Q2 outlook and tariff risks.",
    "pubDate": "Mon, 23 Jun 2025 20:56:00 +0000"
  },
  {
    "title": "Nuclear Power’s Biggest IPO in Years Is on the Way",
    "link": "https://finance.yahoo.com/m/57144676-fd88-3576-9758-6635055b1367/nuclear-power%E2%80%99s-biggest-ipo.html?.tsrc=rss",
    "content": "Holtec CEO says the plan is to go public within several months. The IPO may be coming at just the right time.",
    "pubDate": "Mon, 23 Jun 2025 20:22:00 +0000"
  },
  {
    "title": "US stocks aren’t safe in heated global tensions anymore",
    "link": "https://www.thestreet.com/crypto/markets/us-stocks-arent-safe-in-heated-global-tensions-anymore?.tsrc=rss",
    "content": "Bitcoin's volatility drops below major U.S. stocks as long-term holders drive asset class maturity.",
    "pubDate": "Mon, 23 Jun 2025 19:45:00 +0000"
  },
  {
    "title": "Amazon to Invest $233 Million in India Operations for 2025 for Infrastructure, E-commerce Growth",
    "link": "https://finance.yahoo.com/news/amazon-invest-233-million-india-193734374.html?.tsrc=rss",
    "content": "Amazon.com Inc. (NASDAQ:AMZN) is one of the best QQQ stocks to buy according to hedge funds. On June 19, Amazon announced that the company will invest $233 million in its India operations in 2025. The move underscores Amazon’s commitment to capturing a larger share of India’s rapidly expanding e-commerce market. The investment will enhance infrastructure, […]",
    "pubDate": "Mon, 23 Jun 2025 19:37:34 +0000"
  },
  {
    "title": "Microsoft to Cut Thousands of Jobs as AI Spending Surges",
    "link": "https://finance.yahoo.com/news/microsoft-cut-thousands-jobs-ai-185308228.html?.tsrc=rss",
    "content": "Cuts follow a prior 6,000-person reduction in May; new round expected after fiscal year ends",
    "pubDate": "Mon, 23 Jun 2025 18:53:08 +0000"
  },
  {
    "title": "Jeff Bezos famously neglected to sign a prenup in his first marriage. He’s not making the same mistake twice",
    "link": "https://finance.yahoo.com/news/jeff-bezos-famously-neglected-sign-184734141.html?.tsrc=rss",
    "content": "The Amazon founder, who is worth nearly $224 billion, is set to wed fiancée Lauren Sanchez this week.",
    "pubDate": "Mon, 23 Jun 2025 18:47:34 +0000"
  },
  {
    "title": "Over a million people now have access to the gen-AI powered Alexa+",
    "link": "https://finance.yahoo.com/news/over-million-people-now-access-173840255.html?.tsrc=rss",
    "content": "Alexa+ is available for free during Early Access and will later be free for Prime customers. Non-Prime users will be able to use the service for $19.99 per month after it publicly launches.",
    "pubDate": "Mon, 23 Jun 2025 17:38:40 +0000"
  },
  {
    "title": "Amazon Will Be Largest U.S. Retailer This Year, Beating Walmart, Says J.P. Morgan",
    "link": "https://finance.yahoo.com/m/368a1c97-725a-3b9e-802e-dac48cb4fd1c/amazon-will-be-largest-u.s..html?.tsrc=rss",
    "content": "Internet analyst Doug Anmuth reiterated an Overweight rating and $240 price target for the e-commerce stock.",
    "pubDate": "Mon, 23 Jun 2025 16:25:00 +0000"
  },
  {
    "title": "Analyst's Bold Amazon Call Has Traders Talking",
    "link": "https://finance.yahoo.com/news/analysts-bold-amazon-call-traders-155059165.html?.tsrc=rss",
    "content": "This analyst call has Amazon stock investors on alert",
    "pubDate": "Mon, 23 Jun 2025 15:50:59 +0000"
  },
  {
    "title": "Can Amazon Continue to Dominate the Fast Cloud Security Market Growth?",
    "link": "https://finance.yahoo.com/news/amazon-continue-dominate-fast-cloud-153400300.html?.tsrc=rss",
    "content": "AMZN strengthens AWS security tools and ecosystem to defend its lead in the fast-growing cloud security market.",
    "pubDate": "Mon, 23 Jun 2025 15:34:00 +0000"
  },
  {
    "title": "Are You a Momentum Investor? This 1 Stock Could Be the Perfect Pick",
    "link": "https://finance.yahoo.com/news/momentum-investor-1-stock-could-135009997.html?.tsrc=rss",
    "content": "Wondering how to pick strong, market-beating stocks for your investment portfolio? Look no further than the Zacks Style Scores.",
    "pubDate": "Mon, 23 Jun 2025 13:50:09 +0000"
  }
]